{
    "title": "Curry Chicken Salad",
    "ingredients": [
        "whole chicken",
        "water",
        "salt and pepper",
        "turmeric",
        "curry powder",
        "mayonnaise",
        "seasoning",
        "cucumber",
        "carrot",
        "celery",
        "grapes",
        "spices",
        "soft drink",
        "greens"
    ],
    "health_score": 18,
    "missing_ingredients": [],
    "vegetarian": false,
    "gluten_free": true,
    "ready_in_minutes": 25,
    "price_per_serving": 322.54,
    "source_url": "http://www.foodista.com/recipe/RSNP5GR2/low-carb-curry-chicken-salad",
    "image_url": "https://spoonacular.com/recipeImages/650378-312x231.jpg",
    "summary": "Need a <b>gluten free, dairy free, whole 30, and ketogenic main course</b>? Curry Chicken Salad could be an amazing recipe to try. This recipe serves 2 and costs $3.23 per serving. One serving contains <b>683 calories</b>, <b>35g of protein</b>, and <b>53g of fat</b>. Head to the store and pick up salad greens, carrot, turmeric powder, and a few other things to make it today. From preparation to the plate, this recipe takes roughly <b>25 minutes</b>. It is a <b>pretty expensive</b> recipe for fans of Indian food. This recipe is liked by 1 foodies and cooks. It is brought to you by Foodista. Overall, this recipe earns a <b>good spoonacular score of 60%</b>. Users who liked this recipe also liked <a href=\"https://spoonacular.com/recipes/curry-chicken-salad-123174\">Curry Chicken Salad</a>, <a href=\"https://spoonacular.com/recipes/curry-chicken-salad-471066\">Curry Chicken Salad</a>, and <a href=\"https://spoonacular.com/recipes/curry-chicken-salad-1244899\">Curry Chicken Salad</a>.",
    "servings": 2,
    "instructions": [
        "Step 1: Strain the water from the cans of chicken and place the chicken in large mixing bowl.",
        "Step 2: Add mayonnaise. You can use more or less based on how moist you like your chicken salad.Season with salt and pepper to taste, go easy on the seasoning at this point because the main seasoning will occur at the end when you add the spices. Drop in the diced celery, carrot, cucumber and grapes and mix well. Once all the ingredients have been combined, add additional mayonnaise if you prefer a wetter consistency to the salad.Once the consistency is right, add in curry powder and turmeric powder. These are they key ingredients, so make sure you are using high quality spices. Start with a small amount of each spice and gradually add to taste - the measurements here are just recommendations, you should taste test as you go along. If possible, pop your mixing bowl into the fridge for an hour to let the flavors marry.",
        "Step 3: Serve of the Curry Chicken Salad on top of salad greens, no dressing necessary."
    ],
    "calories": 682,
    "fat": 52,
    "carbohydrates": 16,
    "protein": 34
}