{"Thursday": [{"title": "Cabbage Stew", "ingredients": ["cabbage", "carrot", "leek", "ground meat", "onion", "vegetable broth", "bay leaves", "tomato", "garlic", "salt and pepper", "dried herbs", "vegetable", "ciabatta"], "health_score": 77, "missing_ingredients": [], "vegetarian": true, "gluten_free": true, "ready_in_minutes": 45, "price_per_serving": 251.09, "source_url": "http://spoonacular.com/-1378756906571", "image_url": "https://spoonacular.com/recipeImages/149627-312x231.jpg", "summary": "Cabbage Stew could be just the <b>gluten free, dairy free, paleolithic, and lacto ovo vegetarian</b> recipe you've been looking for. For <b>$2.51 per serving</b>, you get a hor d'oeuvre that serves 2. One serving contains <b>354 calories</b>, <b>9g of protein</b>, and <b>15g of fat</b>. It is brought to you by spoonacular user <a href=\"/profile/coffeebean\">coffeebean</a>. From preparation to the plate, this recipe takes around <b>45 minutes</b>. It can be enjoyed any time, but it is especially good for <b>Autumn</b>. If you have bay leaves, cabbage, vegetable broth, and a few other ingredients on hand, you can make it. Users who liked this recipe also liked <a href=\"https://spoonacular.com/recipes/ww-cabbage-stew-94074\">Ww Cabbage Stew</a>, <a href=\"https://spoonacular.com/recipes/cabbage-stew-582188\">Cabbage Stew</a>, and <a href=\"https://spoonacular.com/recipes/kielbasa-cabbage-stew-428506\">Kielbasa Cabbage Stew</a>.", "servings": 2, "instructions": ["Step 1: Slice the leeks, mince the onion, dice the carrots, and chop the cabbage.", "Step 2: Saute the onion and carrots in a large pot until the onions are translucent and the carrots start to get soft.    Meanwhile, in another pan, lightly fry the cabbage.", "Step 3: Add the leeks to the pot with onion and carrots and cook for another couple minutes.", "Step 4: Add the tomatoes and vegetable broth to the pot along with the garlic and bay leaves. Bring to a boil and reduce to a simmer.    When the cabbage starts to brown, add it to the pot.", "Step 5: Let simmer for another 10-15 minutes until all the vegetables are tender. Be careful not to let them get too soft.    Season with fresh or dried herbs, add salt and pepper to taste.", "Step 6: Serve with ciabatta."], "calories": 354, "fat": 15, "carbohydrates": 53, "protein": 9}, {"title": "Strawberry-Mango Quinoa Salad", "ingredients": ["quinoa", "water", "salt", "cooked quinoa", "lime juice", "sour cream", "olive oil", "spread", "honey", "strawberries", "cucumber", "pepper", "mango", "mint"], "health_score": 66, "missing_ingredients": [], "vegetarian": true, "gluten_free": true, "ready_in_minutes": 45, "price_per_serving": 187.33, "source_url": "http://www.foodista.com/recipe/K2BYJP76/strawberry-mango-quinoa-salad", "image_url": "https://spoonacular.com/recipeImages/661925-312x231.jpg", "summary": "Need a <b>gluten free and lacto ovo vegetarian hor d'oeuvre</b>? Strawberry-Mango Quinoa Salad could be an awesome recipe to try. This recipe serves 4. One serving contains <b>354 calories</b>, <b>8g of protein</b>, and <b>17g of fat</b>. For <b>$1.87 per serving</b>, this recipe <b>covers 21%</b> of your daily requirements of vitamins and minerals. 41 person were impressed by this recipe. This recipe from Foodista requires cucumber, cream, mango, and strawberries. From preparation to the plate, this recipe takes about <b>45 minutes</b>. All things considered, we decided this recipe <b>deserves a spoonacular score of 97%</b>. This score is tremendous. Similar recipes are <a href=\"https://spoonacular.com/recipes/strawberry-mango-quinoa-salad-1578467\">Strawberry-Mango Quinoa Salad</a>, <a href=\"https://spoonacular.com/recipes/strawberry-mango-quinoa-salad-1588251\">Strawberry-Mango Quinoa Salad</a>, and <a href=\"https://spoonacular.com/recipes/strawberry-mango-chopped-spinach-quinoa-salad-with-sesame-lime-vinaigrette-1469287\">Strawberry & Mango Chopped Spinach Quinoa Salad with Sesame-Lime Vinaigrette</a>.", "servings": 4, "instructions": ["Step 1: Prepare the quinoa: In a medium saucepan combine the quinoa, water and 1/4 t. salt. Bring to a boil, reduce heat to low, cover and simmer until the liquid is just absorbed, about 15 minutes.", "Step 2: Spread the cooked quinoa out on a baking sheet to cool for about 20 minutes.In a large bowl whisk together lime juice, zest, honey, sour cream and olive oil.", "Step 3: Add the cooled quinoa, strawberries, mango, cucumber and mint. Toss well to combine and season with salt &amp; pepper.", "Step 4: Serve immediately."], "calories": 353, "fat": 16, "carbohydrates": 45, "protein": 7}, {"title": "Carrot and Coriander Soup", "ingredients": ["carrot", "butter", "onion", "cooking oil", "ground coriander", "salt and pepper", "orange juice", "water", "fresh cilantro", "soup"], "health_score": 62, "missing_ingredients": [], "vegetarian": true, "gluten_free": true, "ready_in_minutes": 45, "price_per_serving": 132.31, "source_url": "https://www.foodista.com/recipe/35DDN3J3/carrot-and-coriander-soup", "image_url": "https://spoonacular.com/recipeImages/637164-312x231.jpg", "summary": "Carrot and Coriander Soup might be a good recipe to expand your hor d'oeuvre repertoire. One serving contains <b>354 calories</b>, <b>5g of protein</b>, and <b>15g of fat</b>. This recipe serves 1 and costs $1.32 per serving. This recipe from Foodista requires carrots-peeled, onion-chopped, water, and pepper. 3 people were impressed by this recipe. It is perfect for <b>Autumn</b>. It is a good option if you're following a <b>gluten free, dairy free, paleolithic, and lacto ovo vegetarian</b> diet. From preparation to the plate, this recipe takes about <b>45 minutes</b>. With a spoonacular <b>score of 92%</b>, this dish is outstanding. <a href=\"https://spoonacular.com/recipes/carrot-and-coriander-soup-1198221\">Carrot and coriander soup</a>, <a href=\"https://spoonacular.com/recipes/carrot-and-coriander-soup-630764\">Carrot and coriander soup</a>, and <a href=\"https://spoonacular.com/recipes/carrot-and-coriander-soup-1088974\">Carrot and coriander soup</a> are very similar to this recipe.", "servings": 1, "instructions": ["Step 1: In a deep pot, heat oil or butter and add the chopped onions until soft.Now add the carrots and saute for a few minutes.", "Step 2: Add the water, salt and pepper .Cover and cook until the carrots are done.Now add the orange juice and the coriander powder.", "Step 3: Let it cook for 2 more minutes.Puree the soup in a blender and garnish with fresh coriander.", "Step 4: Serve hot!"], "calories": 353, "fat": 15, "carbohydrates": 53, "protein": 5}, {"title": "Chunky Tomato Gazpacho", "ingredients": ["green pepper", "tomato", "onion", "water", "olives"], "health_score": 51, "missing_ingredients": [], "vegetarian": true, "gluten_free": false, "ready_in_minutes": 45, "price_per_serving": 208.74, "source_url": "http://www.foodista.com/recipe/H5MXV6VG/chunky-tomato-gazpacho", "image_url": "https://spoonacular.com/recipeImages/639388-312x231.jpg", "summary": "Chunky Tomato Gazpacho is a hor d'oeuvre that serves 6. For <b>$2.09 per serving</b>, this recipe <b>covers 23%</b> of your daily requirements of vitamins and minerals. One serving contains <b>340 calories</b>, <b>7g of protein</b>, and <b>22g of fat</b>. This recipe is liked by 1 foodies and cooks. It is perfect for <b>Summer</b>. It is a good option if you're following a <b>dairy free, lacto ovo vegetarian, and vegan</b> diet. Head to the store and pick up avocado, garlic, sherry wine vinegar, and a few other things to make it today. From preparation to the plate, this recipe takes around <b>45 minutes</b>. It is brought to you by Foodista. All things considered, we decided this recipe <b>deserves a spoonacular score of 83%</b>. This score is tremendous. If you like this recipe, take a look at these similar recipes: <a href=\"https://spoonacular.com/recipes/chunky-tomato-fruit-gazpacho-27774\">Chunky Tomato-Fruit Gazpacho</a>, <a href=\"https://spoonacular.com/recipes/chunky-gazpacho-205208\">Chunky Gazpacho</a>, and <a href=\"https://spoonacular.com/recipes/chunky-gazpacho-with-sauted-shrimp-199269\">Chunky Gazpacho with Sautéed Shrimp</a>.", "servings": 6, "instructions": ["Step 1: Put the tomatoes, green pepper and onion in a blender and puree. (BTW, you can easily peel tomatoes by submerging them in boiling water for a minute or two after which the skins should come off easily.)", "Step 2: Add the rest of the ingredients to the tomato mixture and garnish with your favorite chopped olives."], "calories": 340, "fat": 21, "carbohydrates": 34, "protein": 7}], "Tuesday": [{"title": "Luscious Palak Paneer", "ingredients": ["baking powder", "spinach", "water", "chili pepper", "tomato", "garlic", "ginger", "onion", "cooking oil", "ground coriander", "cardamom powder", "ground cinnamon", "turmeric", "ground fennel", "ground cumin", "salt", "single cream", "paneer", "paratha", "naan", "rice"], "health_score": 60, "missing_ingredients": [], "vegetarian": true, "gluten_free": true, "ready_in_minutes": 30, "price_per_serving": 557.85, "source_url": "http://www.foodista.com/recipe/WKQQKG5K/luscious-palak-paneer", "image_url": "https://spoonacular.com/recipeImages/650484-312x231.jpg", "summary": "Luscious Palak Paneer requires around <b>30 minutes</b> from start to finish. This recipe makes 2 servings with <b>560 calories</b>, <b>22g of protein</b>, and <b>43g of fat</b> each. For <b>$5.58 per serving</b>, this recipe <b>covers 36%</b> of your daily requirements of vitamins and minerals. Not a lot of people made this recipe, and 1 would say it hit the spot. This recipe is typical of Indian cuisine. It is brought to you by Foodista. It works well as a main course. If you have water, cardamom powder, onion, and a few other ingredients on hand, you can make it. It is a good option if you're following a <b>gluten free and lacto ovo vegetarian</b> diet. With a spoonacular <b>score of 85%</b>, this dish is amazing. Similar recipes are <a href=\"https://spoonacular.com/recipes/palak-paneer-restaurant-style-punjabi-palak-paneer-600320\">Palak Paneer | Restaurant style Punjabi Palak Paneer</a>, <a href=\"https://spoonacular.com/recipes/dinner-tonight-palak-aalu-palak-paneers-cousin-1297965\">Dinner Tonight: Palak Aalu, Palak Paneer's Cousin</a>, and <a href=\"https://spoonacular.com/recipes/dinner-tonight-palak-aalu-palak-paneers-cousin-208659\">Dinner Tonight: Palak Aalu, Palak Paneer's Cousin</a>.", "servings": 2, "instructions": ["Step 1: Blanch the spinach in hot water with a tiny pinch of baking powder (which keeps it beautifully green!) and drain when wilted.", "Step 2: Place in a blender and puree with a cup of water. Set the puree aside.In a large pan heat the oil and add the onions, garlic, ginger, chillies and tomatoes. Cook for around 5 minutes on a high heat stirring constantly. Do not let it burn.", "Step 3: Add the spinach puree, turmeric powder, cumin powder, coriander powder, fennel powder, cinnamon powder, cardamom powder and salt to taste. Simmer on a medium heat until the oil separates from the spinach mixture.", "Step 4: Add the paneer and single cream if you wish and remove from the heat.", "Step 5: Serve with naan, rice, or paratha."], "calories": 559, "fat": 43, "carbohydrates": 24, "protein": 22}, {"title": "Boiled Egg Curry", "ingredients": ["water", "egg", "canola oil", "onion", "green chili pepper", "fried onions", "tomato", "garlic", "ginger", "spices", "cooking oil", "gravy", "coriander", "flatbread", "rice"], "health_score": 15, "missing_ingredients": [], "vegetarian": true, "gluten_free": true, "ready_in_minutes": 45, "price_per_serving": 206.76, "source_url": "http://www.foodista.com/recipe/64SQ5YPT/boiled-egg-curry", "image_url": "https://spoonacular.com/recipeImages/635601-312x231.jpg", "summary": "You can never have too many main course recipes, so give Boiled Egg Curry a try. This recipe serves 2. Watching your figure? This gluten free, dairy free, lacto ovo vegetarian, and whole 30 recipe has <b>515 calories</b>, <b>16g of protein</b>, and <b>40g of fat</b> per serving. For <b>$2.07 per serving</b>, this recipe <b>covers 23%</b> of your daily requirements of vitamins and minerals. 2 people were impressed by this recipe. This recipe is typical of Indian cuisine. A mixture of canolan oil, salt, ground coriander, and a handful of other ingredients are all it takes to make this recipe so tasty. It is brought to you by Foodista. From preparation to the plate, this recipe takes about <b>45 minutes</b>. All things considered, we decided this recipe <b>deserves a spoonacular score of 57%</b>. This score is solid. Try <a href=\"https://spoonacular.com/recipes/boiled-egg-curry-1364959\">Boiled Egg Curry</a>, <a href=\"https://spoonacular.com/recipes/masaledar-ublay-unday-or-hard-boiled-egg-curry-79650\">Masaledar Ublay Unday Or Hard Boiled Egg Curry</a>, and <a href=\"https://spoonacular.com/recipes/hard-boiled-egg-casserole-471051\">Hard-Boiled Egg Casserole</a> for similar recipes.", "servings": 2, "instructions": ["Step 1: Boil 4 eggs in boiling water for about 10 minutes.", "Step 2: Heat 2 tablespoons canola oil in a deep pan over medium heat.", "Step 3: Add the chopped onions and fry until golden. Take off the heat.", "Step 4: Transfer the fried onions from the pan to a food processor. Grind the onions, tomatoes, green chillies into a smooth paste.", "Step 5: Heat the remaining 2 tablespoons of canola oil in the same pan over medium heat.", "Step 6: Add the onion paste. Fry for 2-3 minutes. Stir in ginger and garlic and all the dry spices. Fry until the oil begins to separate from the onion tomato mixture.", "Step 7: Add 2 cups of water bring to a boil on a medium flame.", "Step 8: Cut the boiled eggs into halves lengthside and add them to the gravy. Simmer for 10 minutes or till the gravy is thickened/ reduced to about 3/4 of the original quantity after you added the water", "Step 9: Garnish with coriander leaves.", "Step 10: Serve hot with rice or flatbread."], "calories": 514, "fat": 39, "carbohydrates": 25, "protein": 16}, {"title": "Knock-Your-Socks-Off Guacamole", "ingredients": ["avocado", "white onion", "chili pepper", "lime juice", "olive oil", "cilantro", "salt and pepper"], "health_score": 59, "missing_ingredients": [], "vegetarian": true, "gluten_free": true, "ready_in_minutes": 15, "price_per_serving": 200.08, "source_url": "https://maplewoodroad.com/knock-your-socks-off-guacamole/", "image_url": "https://spoonacular.com/recipeImages/1697763-312x231.jpg", "summary": "The recipe Knock-Your-Socks-Off Guacamole can be made <b>in approximately 15 minutes</b>. One serving contains <b>463 calories</b>, <b>5g of protein</b>, and <b>44g of fat</b>. For <b>$2.0 per serving</b>, you get a hor d'oeuvre that serves 2. It is a <b>rather cheap</b> recipe for fans of Mexican food. It is a good option if you're following a <b>gluten free, dairy free, paleolithic, and lacto ovo vegetarian</b> diet. A mixture of salt & pepper, onion, habanero pepper, and a handful of other ingredients are all it takes to make this recipe so tasty. It is brought to you by spoonacular user <a href=\"/profile/maplewoodroad\">maplewoodroad</a>. Users who liked this recipe also liked <a href=\"https://spoonacular.com/recipes/easy-eggplant-parmesan-that-will-knock-your-socks-off-572923\">Easy Eggplant Parmesan that Will Knock Your Socks Off</a>, <a href=\"https://spoonacular.com/recipes/knock-your-socks-off-stuffed-potatoes-with-broccoli-and-mushrooms-648985\">Knock Your Socks Off Stuffed Potatoes With Broccoli and Mushrooms</a>, and <a href=\"https://spoonacular.com/recipes/knock-your-socks-off-slow-cooker-chicken-and-sausage-1198533\">Knock Your Socks Off Slow Cooker Chicken and Sausage</a>.", "servings": 2, "instructions": ["Step 1: Cut the avocado in half lengthwise.  Using a chef's knife, give the pit a slight whack, gently turn, and remove.", "Step 2: Scoop avocado out with a spoon and put it in a bowl and mash with a fork.", "Step 3: Add finely chopped white onion (sweet), finely chopped cilantro, a habanero or two (or whatever your favorite hot pepper is), lime juice, and olive oil.", "Step 4: Add salt and pepper.", "Step 5: Mix everything together with the mashed avocados.&nbsp; Enjoy!"], "calories": 462, "fat": 43, "carbohydrates": 21, "protein": 4}, {"title": "Gujarati Dry Mung Bean Curry", "ingredients": ["baking powder", "mung beans", "water", "mustard seeds", "curry leaves", "cumin seeds", "asafoetida", "chili pepper", "garlic", "cooking oil", "soft drink", "tomato", "turmeric", "ground cinnamon", "lemon juice", "coriander", "sugar", "salt"], "health_score": 100, "missing_ingredients": [], "vegetarian": true, "gluten_free": true, "ready_in_minutes": 45, "price_per_serving": 164.1, "source_url": "http://www.foodista.com/recipe/G6ZJW56S/gujarati-dry-mung-bean-curry", "image_url": "https://spoonacular.com/recipeImages/646043-312x231.jpg", "summary": "Gujarati Dry Mung Bean Curry takes about <b>45 minutes</b> from beginning to end. This main course has <b>376 calories</b>, <b>20g of protein</b>, and <b>5g of fat</b> per serving. This recipe serves 4 and costs $1.64 per serving. A mixture of baking powder, cumin seeds, garlic, and a handful of other ingredients are all it takes to make this recipe so flavorful. This recipe from Foodista has 3 fans. This recipe is typical of Indian cuisine. It is a good option if you're following a <b>gluten free, dairy free, lacto ovo vegetarian, and vegan</b> diet. Taking all factors into account, this recipe <b>earns a spoonacular score of 95%</b>, which is outstanding. <a href=\"https://spoonacular.com/recipes/gujarati-dry-mung-bean-curry-1353775\">Gujarati Dry Mung Bean Curry</a>, <a href=\"https://spoonacular.com/recipes/gujarati-dry-mung-bean-curry-1520647\">Gujarati Dry Mung Bean Curry</a>, and <a href=\"https://spoonacular.com/recipes/uncle-bills-mung-bean-curry-1283881\">Uncle Bill's Mung Bean Curry</a> are very similar to this recipe.", "servings": 4, "instructions": ["Step 1: Wash the mung beans and boil them in plenty of hot water with a pinch of baking powder until al-dente. If you have a pressure cooker thats about 6-7 whistles.", "Step 2: Drain and set aside.In a large pan heat the oil and add the mustard seeds (wait for them to pop) then add the cumin seeds, asafoetida, curry leaves, garlic and chillies. Saut until aromatic. Obviously dont let it burn.", "Step 3: Add the tomatoes, turmeric and mung beans and cook for two minutes. Be careful not to mash it up as you stir.", "Step 4: Add the salt, sugar, lemon juice and cinnamon powder and cook for a further two minutes.Throw in the chopped coriander, combine and serve."], "calories": 375, "fat": 5, "carbohydrates": 66, "protein": 19}], "Saturday": [{"title": "Couscous Biryani", "ingredients": ["cinnamon stick", "green chili pepper", "cardamom", "clove", "garlic", "onion", "cooking oil", "turmeric", "chili powder", "garam masala", "mint", "vegetable", "coriander", "salt", "water", "roasted peanuts", "couscous"], "health_score": 40, "missing_ingredients": [], "vegetarian": true, "gluten_free": false, "ready_in_minutes": 45, "price_per_serving": 127.47, "source_url": "http://www.foodista.com/recipe/G2LGMJ8R/couscous-biryani-pulao", "image_url": "https://spoonacular.com/recipeImages/640234-312x231.jpg", "summary": "Couscous Biryani is an Indian recipe that serves 5. This main course has <b>436 calories</b>, <b>16g of protein</b>, and <b>8g of fat</b> per serving. For <b>$1.27 per serving</b>, this recipe <b>covers 18%</b> of your daily requirements of vitamins and minerals. 1 person were impressed by this recipe. From preparation to the plate, this recipe takes roughly <b>45 minutes</b>. This recipe from Foodista requires onion, garam masala, garlic cloves, and cardamom pods. It is a good option if you're following a <b>dairy free, lacto ovo vegetarian, and vegan</b> diet. Overall, this recipe earns a <b>pretty good spoonacular score of 80%</b>. Try <a href=\"https://spoonacular.com/recipes/couscous-biryani-1547395\">Couscous Biryani</a>, <a href=\"https://spoonacular.com/recipes/qabooli-biryani-or-qubooli-biryani-chana-dal-biryani-1621637\">qabooli biryani or qubooli biryani | chana dal biryani</a>, and <a href=\"https://spoonacular.com/recipes/qabooli-biryani-or-qubooli-biryani-chana-dal-biryani-486623\">qabooli biryani or qubooli biryani | chana dal biryani</a> for similar recipes.", "servings": 5, "instructions": ["Step 1: Heat oil in a pan, when hot add the cinnamon stick, cardamom and cloves.When the aroma rises add the onions, green chilies and garlic, saute for few mins until onion turns pink.", "Step 2: Add the vegetables and saute until the vegetables are half done.Now add the red chilly powder, turmeric powder, garam masala and curry powders, mint leaves, coriander leaves and salt.", "Step 3: Add about 4 cups of water and bring the mixture to boil.", "Step 4: Add the couscous when the mixture is boiling, stir and cover the pan with lid.Simmer the heat and cook the couscous for about 8 mins. When the couscous is done finally add the roasted peanuts and serve hot."], "calories": 436, "fat": 8, "carbohydrates": 75, "protein": 16}, {"title": "Indian Lentil Dahl", "ingredients": ["onion", "salt", "cooking oil", "garam masala", "garlic", "ginger", "coconut milk", "lentils", "water", "lime juice", "seasoning", "cilantro", "tomato", "rice"], "health_score": 20, "missing_ingredients": [], "vegetarian": true, "gluten_free": true, "ready_in_minutes": 45, "price_per_serving": 105.89, "source_url": "http://www.foodista.com/recipe/XMH8PZ48/indian-lentil-dahl", "image_url": "https://spoonacular.com/recipeImages/647830-312x231.jpg", "summary": "The recipe Indian Lentil Dahl can be made <b>in about 45 minutes</b>. This recipe makes 4 servings with <b>400 calories</b>, <b>17g of protein</b>, and <b>20g of fat</b> each. For <b>$1.06 per serving</b>, this recipe <b>covers 23%</b> of your daily requirements of vitamins and minerals. It is brought to you by Foodista. A mixture of lime juice, lentils, coconut milk, and a handful of other ingredients are all it takes to make this recipe so yummy. 13 people were glad they tried this recipe. It works well as a main course. It is a <b>rather inexpensive</b> recipe for fans of Indian food. It is a good option if you're following a <b>gluten free, dairy free, lacto ovo vegetarian, and vegan</b> diet. Taking all factors into account, this recipe <b>earns a spoonacular score of 75%</b>, which is solid. Similar recipes include <a href=\"https://spoonacular.com/recipes/indian-spice-52-diet-for-red-lentil-dahl-1368615\">Indian Spice – 5:2 Diet for Red Lentil Dahl</a>, <a href=\"https://spoonacular.com/recipes/indian-spice-52-diet-for-red-lentil-dahl-1201527\">Indian Spice – 5:2 Diet for Red Lentil Dahl</a>, and <a href=\"https://spoonacular.com/recipes/indian-spice-52-diet-for-red-lentil-dahl-666725\">Indian Spice – 5:2 Diet for Red Lentil Dahl</a>.", "servings": 4, "instructions": ["Step 1: In a large saucepan, combine oil, onion and salt at medium-high heat. Cook until onion starts to brown, around 5 minutes or so.", "Step 2: Add garlic, ginger and Garam Masala , cook until fragrant, about 1 minute.", "Step 3: Add lentils, coconut milk and water. Bring to a boil, then reduce heat to low and simmer, partially covered until lentils are fully tender and broken down to an almost paste-like consistency, about 25-30 minutes.", "Step 4: Add lime juice and cilantro. Check for seasoning.", "Step 5: Serve (over rice if you like), topped with the diced tomatoes."], "calories": 400, "fat": 19, "carbohydrates": 41, "protein": 16}, {"title": "Quinoa, Tomato, Green Onion Side Salad", "ingredients": ["quinoa", "water", "green onions", "tomato", "juice", "lemon", "seeds", "lemon juice", "olive oil", "salt and pepper"], "health_score": 90, "missing_ingredients": [], "vegetarian": true, "gluten_free": true, "ready_in_minutes": 45, "price_per_serving": 138.73, "source_url": "http://www.foodista.com/recipe/ZHJ4PP8P/quinoa-tomato-green-onion-salad", "image_url": "https://spoonacular.com/recipeImages/657698-312x231.jpg", "summary": "Quinoa, Tomato, Green Onion Side Salad might be a good recipe to expand your hor d'oeuvre recipe box. For <b>$1.39 per serving</b>, this recipe <b>covers 23%</b> of your daily requirements of vitamins and minerals. One portion of this dish contains about <b>11g of protein</b>, <b>18g of fat</b>, and a total of <b>396 calories</b>. This recipe serves 2. This recipe from Foodista has 2 fans. Head to the store and pick up green onions, water, salt and pepper, and a few other things to make it today. It is a good option if you're following a <b>gluten free, dairy free, lacto ovo vegetarian, and vegan</b> diet. From preparation to the plate, this recipe takes approximately <b>45 minutes</b>. All things considered, we decided this recipe <b>deserves a spoonacular score of 93%</b>. This score is amazing. Users who liked this recipe also liked <a href=\"https://spoonacular.com/recipes/cucumber-tomato-and-green-onion-salad-376668\">Cucumber Tomato and Green Onion Salad</a>, <a href=\"https://spoonacular.com/recipes/feta-and-green-onion-couscous-cakes-over-tomato-olive-salad-133311\">Fetan and Green Onion Couscous Cakes over Tomato-Olive Salad</a>, and <a href=\"https://spoonacular.com/recipes/onion-tomato-gotsu-or-thakkali-kosthu-side-dish-for-idli-dosa-564811\">Onion Tomato Gotsu or Thakkali Kosthu | Side Dish For Idli Dosa</a>.", "servings": 2, "instructions": ["Step 1: Put your quinoa and your water in a pan.", "Step 2: Heat over medium heat until bubbling, then cover and reduce heat to low. Cook for about 15 minutes or until all the water is absorbed.While your quinoa is cooking, get out and wash your green onions and tomatoes. Chop them roughly.Chop a lemon in half and squeeze one half's juice into a bowl, picking out the seeds.", "Step 3: Let your quinoa cool. A little warm is fine.", "Step 4: Add olive oil, lemon juice, and tomatoes and green onions to the pan. Stir.", "Step 5: Add salt and pepper to your liking.", "Step 6: Serve chilled"], "calories": 396, "fat": 18, "carbohydrates": 50, "protein": 10}, {"title": "Indian-Style Eggs On Toast", "ingredients": ["bread", "sandwich bread", "onion", "cooking oil", "tomato", "turmeric", "salt and pepper", "coriander", "egg"], "health_score": 14, "missing_ingredients": [], "vegetarian": true, "gluten_free": false, "ready_in_minutes": 45, "price_per_serving": 110.06, "source_url": "https://www.foodista.com/recipe/2WXM4ZKN/indian-style-eggs-on-toast", "image_url": "https://spoonacular.com/recipeImages/647876-312x231.jpg", "summary": "Indian-Style Eggs On Toast is a <b>dairy free and lacto ovo vegetarian</b> recipe with 2 servings. One portion of this dish contains about <b>21g of protein</b>, <b>12g of fat</b>, and a total of <b>379 calories</b>. For <b>$1.1 per serving</b>, this recipe <b>covers 23%</b> of your daily requirements of vitamins and minerals. From preparation to the plate, this recipe takes roughly <b>45 minutes</b>. This recipe from Foodista has 1 fans. This recipe is typical of Indian cuisine. Only a few people really liked this main course. If you have salt and pepper, coriander leaves, onion, and a few other ingredients on hand, you can make it. Taking all factors into account, this recipe <b>earns a spoonacular score of 57%</b>, which is pretty good. Similar recipes include <a href=\"https://spoonacular.com/recipes/indian-style-eggs-on-toast-1594439\">Indian-Style Eggs On Toast</a>, <a href=\"https://spoonacular.com/recipes/northern-indian-style-baked-eggs-with-green-harissa-naan-625932\">Northern Indian Style Baked Eggs with Green Harissa + Naan</a>, and <a href=\"https://spoonacular.com/recipes/eggs-sardou-new-orleans-style-poached-eggs-with-artichoke-hearts-spinach-and-hollandaise-1215999\">Eggs Sardou (New Orleans-Style Poached Eggs With Artichoke Hearts, Spinach, and Hollandaise)</a>.", "servings": 2, "instructions": ["Step 1: Toast the bread on both sides in a dry frying pan or under the grill and set aside.", "Step 2: Heat some oil in a frying pan. Saut the onions until caramelised.", "Step 3: Add the tomatoes and cook until they soften.", "Step 4: Sprinkle over the turmeric and continue cooking for another minute.", "Step 5: Break in the eggs and cook until required doneness. Stir in the coriander and salt and pepper to taste.", "Step 6: Top the toasts with an equal amount of egg and serve immediately."], "calories": 379, "fat": 12, "carbohydrates": 45, "protein": 20}], "Friday": [{"title": "White Bean & Squash Dip", "ingredients": ["clove", "garlic", "olive oil", "wrap", "squash", "salt", "cooking oil", "cannellini beans", "pasta", "dip"], "health_score": 100, "missing_ingredients": [], "vegetarian": true, "gluten_free": true, "ready_in_minutes": 45, "price_per_serving": 198.52, "source_url": "https://www.foodista.com/recipe/PFGLCQG6/white-bean-squash-dip", "image_url": "https://spoonacular.com/recipeImages/665138-312x231.jpg", "summary": "Need a <b>gluten free, dairy free, lacto ovo vegetarian, and vegan hor d'oeuvre</b>? White Bean & Squash Dip could be a great recipe to try. This recipe serves 3 and costs $1.99 per serving. One serving contains <b>542 calories</b>, <b>18g of protein</b>, and <b>6g of fat</b>. It is brought to you by Foodista. A mixture of globe squash, bulb of garlic, cannellini beans, and a handful of other ingredients are all it takes to make this recipe so flavorful. Not a lot of people made this recipe, and 1 would say it hit the spot. <b>The Super Bowl</b> will be even more special with this recipe. From preparation to the plate, this recipe takes approximately <b>45 minutes</b>. Taking all factors into account, this recipe <b>earns a spoonacular score of 93%</b>, which is outstanding. Users who liked this recipe also liked <a href=\"https://spoonacular.com/recipes/white-bean-and-roasted-delicata-squash-dip-573379\">White Bean and Roasted Delicata Squash Dip</a>, <a href=\"https://spoonacular.com/recipes/white-bean-dip-366280\">White Bean Dip</a>, and <a href=\"https://spoonacular.com/recipes/white-bean-dip-404628\">White Bean Dip</a>.", "servings": 3, "instructions": ["Step 1: Preheat oven to 400F (~205C). Line a baking sheet with parchment paper.", "Step 2: Chop the top off the garlic bulb, exposing the cloves. Rip a sheet of aluminum foil, and place the garlic bulb on top.", "Step 3: Drizzle a teaspoon of olive oil over the garlic, making sure to cover all exposed cloves. Wrap the garlic loosely with foil, but make sure that it is properly sealed. You want to trap heat inside the foil pouch.", "Step 4: Bake the garlic for about 35-45 minutes, or until the cloves are browned. Mine took about 45 minutes.", "Step 5: Chop off the tops and bottoms of each globe squash, and then chop them into small cubes. If you want to create a squash bowl like I did in the photo, save one globe squash for the bowl. Just chop off the top and, using a spoon, dig out all the flesh. Toss the squash with a tablespoon of oil and a small pinch of salt, and bake on the baking sheet for about 20 minutes.", "Step 6: When the garlic is done, open up the foil wrap and let it cool for 10-15 minutes. When the garlic is cool enough to handle, squeeze out the cloves into a food processor.", "Step 7: Add the cannellini beans, roasted squash, and salt into the food processor and blend until smooth. Enjoy as a dip or add it to a pasta dish!", "Step 8: Refrigerate leftovers in an airtight container."], "calories": 541, "fat": 5, "carbohydrates": 118, "protein": 17}, {"title": "Mushroom Hummus Crostini", "ingredients": ["mushrooms", "crostini", "harissa", "spinach", "hummus", "spread", "bread", "pasta", "sandwich bread", "water"], "health_score": 92, "missing_ingredients": [], "vegetarian": true, "gluten_free": false, "ready_in_minutes": 30, "price_per_serving": 240.78, "source_url": "https://www.foodista.com/recipe/DMRJSD86/mushroom-crostini-with-harissa-hummus", "image_url": "https://spoonacular.com/recipeImages/1095745-312x231.jpg", "summary": "Mushroom Hummus Crostini is a Mediterranean hor d'oeuvre. One serving contains <b>450 calories</b>, <b>21g of protein</b>, and <b>10g of fat</b>. This recipe serves 4 and costs $2.41 per serving. Head to the store and pick up water, mushrooms, harissa, and a few other things to make it today. 1 person were impressed by this recipe. From preparation to the plate, this recipe takes around <b>30 minutes</b>. It is a good option if you're following a <b>dairy free, lacto ovo vegetarian, and vegan</b> diet. It is brought to you by Foodista. Taking all factors into account, this recipe <b>earns a spoonacular score of 91%</b>, which is super. If you like this recipe, take a look at these similar recipes: <a href=\"https://spoonacular.com/recipes/hummus-and-cucumber-crostini-22985\">Hummus And Cucumber Crostini</a>, <a href=\"https://spoonacular.com/recipes/seared-tuna-with-hummus-on-crostini-386082\">Seared Tuna with Hummus on Crostini</a>, and <a href=\"https://spoonacular.com/recipes/beet-hummus-and-caramelized-onion-crostini-703941\">Beet Hummus and Caramelized Onion Crostini</a>.", "servings": 4, "instructions": ["Step 1: To make the hummus, place all ingredients in a food processor and blend until smooth. Adjust the amount of water and harissa pasta depending on how thick and spicy you want your hummus. It should still be spreadable. Set the hummus aside.Slice the mushrooms and fry in a shallow pan until they are golden and crispy. Once they are ready, push them to one side of the pan and add the spinach to wilt.To assemble the crostini, spread some hummus on a slice of the bread (you can toast it if you like), then top with some spinach and mushrooms.", "Step 2: Serve immediately."], "calories": 450, "fat": 10, "carbohydrates": 72, "protein": 20}, {"title": "Roma Tomato Bruschetta", "ingredients": ["extra virgin olive oil", "salt and pepper", "bread", "whole garlic cloves", "crostini", "tomato", "basil", "dry seasoning rub", "balsamic vinegar", "olive oil", "pepper", "salt"], "health_score": 61, "missing_ingredients": [], "vegetarian": true, "gluten_free": false, "ready_in_minutes": 45, "price_per_serving": 189.3, "source_url": "http://www.foodista.com/recipe/M3RH6LBH/roma-tomato-bruschetta", "image_url": "https://spoonacular.com/recipeImages/658753-312x231.jpg", "summary": "Need a <b>dairy free, lacto ovo vegetarian, and vegan hor d'oeuvre</b>? Roma Tomato Bruschetta could be an outstanding recipe to try. One serving contains <b>446 calories</b>, <b>13g of protein</b>, and <b>17g of fat</b>. This recipe serves 4 and costs $1.89 per serving. If you have basil, extra virgin olive oil, bread, and a few other ingredients on hand, you can make it. 5 people have made this recipe and would make it again. It is an <b>affordable</b> recipe for fans of Mediterranean food. It is brought to you by Foodista. From preparation to the plate, this recipe takes about <b>45 minutes</b>. Overall, this recipe earns a <b>tremendous spoonacular score of 91%</b>. Try <a href=\"https://spoonacular.com/recipes/roma-tomato-rings-stuffed-with-cream-cheese-107091\">Roma Tomato Rings Stuffed With Cream Cheese</a>, <a href=\"https://spoonacular.com/recipes/tomato-bruschetta-367864\">Tomato Bruschetta</a>, and <a href=\"https://spoonacular.com/recipes/tomato-bruschetta-543381\">Tomato Bruschetta</a> for similar recipes.", "servings": 4, "instructions": ["Step 1: Slice the bread on a bias about 1/2 inch thick. We need about 10-12 slices.Take 2 tablespoons of extra virgin olive oil and add salt and pepper (about 1/3 teaspoon each - as per taste).", "Step 2: Brush this on both sides of the bread.", "Step 3: Place these slices on a sheet pan and bake for about 3-4 minutes in a 400 degree preheated oven till golden brown. Once one side is done, turn over the crostini to the other side to crisp that as well.When the crostini are hot out the oven, rub a garlic clove on them.Chop the tomatoes.Chiffonade the basil and add to the tomatoes.", "Step 4: Add salt, pepper, olive oil and balsamic vinegar and let it rest for a few minutes.Put a generous amount of tomato on the crostini and serve."], "calories": 445, "fat": 16, "carbohydrates": 62, "protein": 12}, {"title": "Mughlai Malai Kofta Curry", "ingredients": ["green chili pepper", "potato", "carrot", "onion", "paneer", "water", "peas", "corn flour", "salt", "raisins", "cashews", "cooking oil", "corn starch", "cookies", "ground coriander", "turmeric", "ground cumin", "garlic", "ginger", "chili powder", "tomato puree", "gravy", "garam masala", "flatbread", "cream", "roti"], "health_score": 50, "missing_ingredients": [], "vegetarian": true, "gluten_free": true, "ready_in_minutes": 45, "price_per_serving": 194.79, "source_url": "http://www.foodista.com/recipe/HKVP8LCX/mughlai-malai-kofta-curry", "image_url": "https://spoonacular.com/recipeImages/652542-312x231.jpg", "summary": "Mughlai Malai Kofta Curry might be a good recipe to expand your main course recipe box. One serving contains <b>441 calories</b>, <b>15g of protein</b>, and <b>6g of fat</b>. For <b>$1.95 per serving</b>, this recipe <b>covers 25%</b> of your daily requirements of vitamins and minerals. This recipe serves 4. Only a few people really liked this Indian dish. It is a good option if you're following a <b>gluten free and lacto ovo vegetarian</b> diet. 1 person were impressed by this recipe. If you have chillies, thai chillies, salt, and a few other ingredients on hand, you can make it. From preparation to the plate, this recipe takes about <b>45 minutes</b>. It is brought to you by Foodista. All things considered, we decided this recipe <b>deserves a spoonacular score of 84%</b>. This score is amazing. Try <a href=\"https://spoonacular.com/recipes/malai-kofta-how-to-make-malai-kofta-1204187\">malai kofta , how to make malai kofta</a>, <a href=\"https://spoonacular.com/recipes/malai-kofta-how-to-make-malai-kofta-487287\">malai kofta , how to make malai kofta</a>, and <a href=\"https://spoonacular.com/recipes/homemade-naan-with-malai-kofta-52243\">Homemade Naan with Malai Kofta</a> for similar recipes.", "servings": 4, "instructions": ["Step 1: Boil the potatoes, cool, peel and grate them.Grate paneer.Wash all green chillies, deseed and chop them fine.Peel carrots,grate them, add peas and some water, boil them in microwave for 10 mins. Once done, remove excess by passing & squeezing it through a muslin cloth.Peel onions, cut them into halves and boil with a cup of water for ten minutes.", "Step 2: Drain excess water, cool onions and grind them into a smooth paste. Set Aside.In a bowl, mix mashed potatoes, paneer, some chopped green chillies, boiled carrot-peas, corn flour and salt.", "Step 3: Mix well. Divide into 20-22 equal sized balls. Stuff  raisins & cashew into them. Deep fry in hot oil until slightly golden brown.", "Step 4: Drain and keep aside. Fry one kofta and check for binding, if it breaks, add a little more cornflour. Deep fry in hot oil.OR BAKE in a 375F pre-heat oven, by arranging & spraying oil on these koftas placing them on a cookie sheet wraped with aluminum foil,for 10 mins. Keep a close watch, with the help of tongs, turn them once they are slight brown on one side.On the other side heat oil in a kadai, add shahjeera, boiled onion paste and cook for five minutes.", "Step 5: Add ginger & garlic, few chopped green chillies, coriander powder, cumin powder, turmeric powder, and salt. cook for a minute.", "Step 6: Add tomato puree and red chilli powder and cook on medium flame untill oil separates from gravy.", "Step 7: Add half&half along with some water & bring it to a boil and simmer for ten minutes on a slow flame. Stir occasionally.Stir in fresh cream and garam masala powder.Gently put all of these kofta's in the gravy when ready to serve. Simmer for another 2 mins and enjoy this rich, creamy gravy with Nan/Roti (Indian Flat Bread.)"], "calories": 441, "fat": 6, "carbohydrates": 85, "protein": 14}], "Monday": [{"title": "Kashmiri Rogan Josh", "ingredients": ["fennel seeds", "yogurt", "asafoetida", "cinnamon", "ground cayenne pepper", "paprika", "clove", "meat", "salt", "cooking oil", "fennel", "ginger", "broth", "water", "garam masala", "brown sauce"], "health_score": 20, "missing_ingredients": [], "vegetarian": false, "gluten_free": true, "ready_in_minutes": 45, "price_per_serving": 416.84, "source_url": "http://www.foodista.com/recipe/SQPFZHZF/kashmiri-rogan-josh", "image_url": "https://spoonacular.com/recipeImages/648774-312x231.jpg", "summary": "You can never have too many main course recipes, so give Kashmiri Rogan Josh a try. This recipe serves 6 and costs $4.17 per serving. One portion of this dish contains about <b>44g of protein</b>, <b>63g of fat</b>, and a total of <b>778 calories</b>. Not a lot of people made this recipe, and 1 would say it hit the spot. This recipe from Foodista requires pch asafetida, yogurt, cayenne pepper, and ginger. It is a <b>pretty expensive</b> recipe for fans of Indian food. It is a good option if you're following a <b>gluten free and ketogenic</b> diet. From preparation to the plate, this recipe takes about <b>45 minutes</b>. Taking all factors into account, this recipe <b>earns a spoonacular score of 71%</b>, which is solid. If you like this recipe, take a look at these similar recipes: <a href=\"https://spoonacular.com/recipes/kashmiri-rogan-josh-1199343\">Kashmiri Rogan Josh</a>, <a href=\"https://spoonacular.com/recipes/rogan-josh-kashmiri-lamb-curry-97325\">Rogan Josh (Kashmiri Lamb Curry)</a>, and <a href=\"https://spoonacular.com/recipes/kashmiri-rogan-josh-indian-mutton-lamb-curry-98123\">Kashmiri Rogan Josh (Indian Mutton/ Lamb Curry)</a>.", "servings": 6, "instructions": ["Step 1: Grind the fennel seeds until find.", "Step 2: Put the yogurt in a bowl and beat it with a fork until smooth and creamy.", "Step 3: Heat the oil in a large pot over a high flame. When hot, put in the cinnamon and cloves.A second later, put in the ground asafetida. A second after that, put in all the meat and the salt.Stir the meat an cook, still on a high flame for about 5 minutes. Now put in the paprika and cayenne and give the meat a good stir. Slowly add the yogurt, a small amount at a time, stirring the meat vigorously as you do so.", "Step 4: Add all the yogurt this way. Keep cooking on high heat until all liquid has boiled away and the meat pieces have browned slightly.", "Step 5: Add the fennel and ginger. Give the meat some more good stirs. Now put in the water or broth, cover so as to leave the lid very slightly ajar, and cook on medium heat for 30 minutes.Cover completely and cook on low heat for another 45 minutes or until meat is tinder. Stir a few times as the meat cooks, making sure that there is always some liquid in the pot.", "Step 6: Remove the lid and add the garam masala. You should have a thick, reddish brown sauce. If it is too thin, boil away some of the liquid."], "calories": 778, "fat": 62, "carbohydrates": 7, "protein": 44}, {"title": "Curry Mussels", "ingredients": ["olive oil", "onion", "cayenne pepper", "white wine", "pepper", "salt", "mussels", "curry powder", "sauce", "parsley"], "health_score": 80, "missing_ingredients": [], "vegetarian": false, "gluten_free": true, "ready_in_minutes": 45, "price_per_serving": 571.82, "source_url": "https://www.foodista.com/recipe/4ZL4SYFD/curry-mussels", "image_url": "https://spoonacular.com/recipeImages/641128-312x231.jpg", "summary": "Curry Mussels is a <b>gluten free, primal, and pescatarian</b> hor d'oeuvre. One portion of this dish contains around <b>64g of protein</b>, <b>33g of fat</b>, and a total of <b>743 calories</b>. For <b>$5.72 per serving</b>, this recipe <b>covers 51%</b> of your daily requirements of vitamins and minerals. This recipe serves 2. This recipe from Foodista has 1 fans. If you have crème fraiche, cayenne pepper, parsley, and a few other ingredients on hand, you can make it. It is an <b>expensive</b> recipe for fans of Indian food. From preparation to the plate, this recipe takes approximately <b>45 minutes</b>. With a spoonacular <b>score of 89%</b>, this dish is amazing. If you like this recipe, take a look at these similar recipes: <a href=\"https://spoonacular.com/recipes/coconut-curry-mussels-247054\">Coconut Curry Mussels</a>, <a href=\"https://spoonacular.com/recipes/coconut-curry-mussels-568548\">Coconut Curry Mussels</a>, and <a href=\"https://spoonacular.com/recipes/coconut-curry-mussels-54272\">Coconut Curry Mussels</a>.", "servings": 2, "instructions": ["Step 1: In a big pot or cocotte, put in olive oil and onion. Fry the onions until soft but not brown.", "Step 2: Then, put in white wine, parseley, salt, pepper, and cayenne pepper.", "Step 3: Stir for a few minutes before putting the mussels in the pot.", "Step 4: Put the lid on and cook the mussels for about 2-3 minutes, shaking the pan occasionally.", "Step 5: Use tongs to lift out the mussels as they open, putting them into a warm dish. Throw away any mussels that havent opened after 3 minutes.", "Step 6: Strain the liquid through a fine sieve into a clean saucepan, leaving behind any grit or sand.", "Step 7: Bring to the boil and  boil for 2 minutes.", "Step 8: Add the curry powder and crme fraiche, stir. Reheat the sauce without boiling and let the sauce thicken.", "Step 9: Serve the mussels in individual bowls with the sauce poured over.", "Step 10: Sprinkle with some parsley."], "calories": 742, "fat": 33, "carbohydrates": 31, "protein": 63}, {"title": "Crock-Pot: Asian-Style Country Ribs with Black Bean Garlic Sauce", "ingredients": ["snow peas", "garlic", "sauce", "ribs", "rice", "cooking spray", "pork", "corn starch", "soy sauce", "ginger", "pepper", "honey", "mirin", "sesame oil", "green onions"], "health_score": 12, "missing_ingredients": [], "vegetarian": false, "gluten_free": false, "ready_in_minutes": 45, "price_per_serving": 234.99, "source_url": "http://oneperfectbite.blogspot.com/2008/10/crock-pot-asian-style-country-ribs-with.html", "image_url": "https://spoonacular.com/recipeImages/735820-312x231.jpg", "summary": "Crock-Pot: Asian-Style Country Ribs with Black Bean Garlic Sauce could be just the <b>dairy free and ketogenic</b> recipe you've been looking for. One serving contains <b>732 calories</b>, <b>39g of protein</b>, and <b>58g of fat</b>. This recipe serves 4. For <b>$2.35 per serving</b>, this recipe <b>covers 25%</b> of your daily requirements of vitamins and minerals. Many people really liked this main course. If you have soy salt, country, ginger root, and a few other ingredients on hand, you can make it. 912 people have made this recipe and would make it again. It is a <b>rather inexpensive</b> recipe for fans of Asian food. It is brought to you by oneperfectbite.blogspot.com. From preparation to the plate, this recipe takes roughly <b>45 minutes</b>. Overall, this recipe earns a <b>good spoonacular score of 75%</b>. Users who liked this recipe also liked <a href=\"https://spoonacular.com/recipes/crock-pot-asian-style-country-ribs-with-black-bean-garlic-sauce-1242665\">Crock-Pot: Asian-Style Country Ribs with Black Bean Garlic Sauce</a>, <a href=\"https://spoonacular.com/recipes/crock-pot-indonesian-style-country-ribs-114372\">Crock Pot Indonesian Style Country Ribs</a>, and <a href=\"https://spoonacular.com/recipes/crock-pot-bbq-country-style-ribs-484544\">Crock Pot BBQ Country Style Ribs</a>.", "servings": 4, "instructions": ["Step 1: This crock-pot entre is really, really good. It takes 10 minutes to prepare, is made from ingredients that are readily available and is a bargain when you consider the number of servings it provides.  One caution -  you'll have mush with  Asian flavor if you cook this for more than 5 to 6 hours. The recipe is adapted from \"Slow Cooker Recipes for All Occasions\",  a Rival Crock-Pot publication.", "Step 2: Served with rice and snow peas you have the makings of a minor feast that you'll repeat often. My family loves this dish. I think yours will, too. This, by the way, is a wonderful recipe for novice cooks. If you have a willing teen, let them have a go at it.Asian-Style Country Ribs with Black Bean Garlic Sauce", "Step 1: Spray interior of slow cooker with nonstick cooking spray.", "Step 2: Place pork cubes in slow cooker.", "Step 3: Combine black bean garlic sauce, soy sauce, mirin, honey, ginger, garlic, pepper and cornstarch in a small bowl; stir to dissolve cornstarch.", "Step 4: Pour over ribs.", "Step 5: Cook, covered, on LOW setting for 5 to 6 hours until ribs are tender but still hold their shape.", "Step 6: Transfer ribs to a rimmed serving platter; tent with foil to keep warm. Strain liquid into a small pan. Bring liquid to a boil over medium-high heat; cook until mixture begins to thicken and is reduced by half. Stir in sesame oil.", "Step 7: Add sauce and 1/4 cup scallions to pork cubes.", "Step 8: Mix well.", "Step 9: Garnish with reserved 2 tablespoons scallions."], "calories": 732, "fat": 58, "carbohydrates": 11, "protein": 38}, {"title": "Bibimbab (Korean Rice w Vegetables & Beef)", "ingredients": ["rice", "vegetable", "water", "olive oil", "spinach", "carrot", "garlic", "red pepper flakes", "gochugaru", "cucumber", "soy sauce", "beef", "egg yolk", "egg", "gochujang", "sriracha", "lettuce leaf", "sesame seeds", "sesame oil", "meat"], "health_score": 46, "missing_ingredients": [], "vegetarian": false, "gluten_free": true, "ready_in_minutes": 45, "price_per_serving": 480.18, "source_url": "http://www.foodista.com/recipe/7SFVMHXW/bibimbab-korean-rice-w-vegetables-beef", "image_url": "https://spoonacular.com/recipeImages/634965-312x231.jpg", "summary": "Forget going out to eat or ordering takeout every time you crave Korean food. Try making Bibimbab (Korean Rice w Vegetables & Beef) at home. This gluten free and dairy free recipe serves 4 and costs <b>$4.8 per serving</b>. This main course has <b>680 calories</b>, <b>40g of protein</b>, and <b>32g of fat</b> per serving. If you have garlic clove, sesame oil, sesame seeds, and a few other ingredients on hand, you can make it. This recipe from Foodista has 2 fans. From preparation to the plate, this recipe takes roughly <b>45 minutes</b>. Taking all factors into account, this recipe <b>earns a spoonacular score of 83%</b>, which is great. <a href=\"https://spoonacular.com/recipes/bibimbab-korean-rice-w-vegetables-beef-1297907\">Bibimbab (Korean Rice w Vegetables & Beef)</a>, <a href=\"https://spoonacular.com/recipes/korean-bibimbab-rice-w-vegetables-beef-1507229\">Korean Bibimbab (Rice w Vegetables & Beef)</a>, and <a href=\"https://spoonacular.com/recipes/korean-bibimbab-rice-w-vegetables-beef-649031\">Korean Bibimbab (Rice w Vegetables & Beef)</a> are very similar to this recipe.", "servings": 4, "instructions": ["Step 1: Cook rice according to package directions.", "Step 2: Cut vegetables into matchstick pieces and set aside for sauteing.3.In a large non-stick pan/skillet, bring 2 cups water to a boil.", "Step 3: Add spinach and cook, stirring constantly until wilted; drain. When cool enough to handle, squeeze spinach dry into a ball.4.Wipe out skillet; heat 1 tsp olive oil over medium-high.", "Step 4: Add carrots and cook until soft, 3 minutes.", "Step 5: Add garlic and cook until fragrant or semi-browned, 1 minute.", "Step 6: Add cucumber slices mixed with gochugaru (red pepper flakes).", "Step 7: Combine spinach and soy sauce; set aside until serving.", "Step 8: Add thinly sliced beef to non-stick pan and heat until browned. Wipe down with napkin.", "Step 9: Heat 1 tsp olive oil in non-stick pan over medium-high.", "Step 10: Add eggs and cook until whites are set and yolks are still runny, about 5 minutes.7.Divide rice among four bowls; top with vegetables and eggs.", "Step 11: Drizzle each with sesame oil, sprinkle with sesame seeds. Top with gochujang (red pepper paste) or Sriracha sauce as substitute.*Bibimbab and its main ingredients (usually rice and vegetables) can be chosen at one's preference. This is the main reason why bibimbab is so appealing; it suits vegetarians, dieters, health-conscience eaters, and even meat-lovers, who are more than welcome to add beef to their liking. For us, since we usually have rice available to eat at all times, we simply slice up any available vegetables or lettuce leaf varieties in the fridge for an \"instant\" and very satisfying bibimbab meal. So feel free to deviate from the original recipe!"], "calories": 679, "fat": 31, "carbohydrates": 60, "protein": 39}], "Sunday": [{"title": "Zesty Spinach Salad", "ingredients": ["spring onions", "pomegranate", "chicken nuggets", "spinach", "apple", "black pepper", "lime juice", "olive oil"], "health_score": 81, "missing_ingredients": [], "vegetarian": true, "gluten_free": true, "ready_in_minutes": 45, "price_per_serving": 296.68, "source_url": "http://www.foodista.com/recipe/6QCDXL7M/zesty-spinach-salad", "image_url": "https://spoonacular.com/recipeImages/665653-312x231.jpg", "summary": "If you want to add more <b>gluten free, dairy free, paleolithic, and lacto ovo vegetarian</b> recipes to your collection, Zesty Spinach Salad might be a recipe you should try. For <b>$2.97 per serving</b>, you get a hor d'oeuvre that serves 1. One portion of this dish contains around <b>7g of protein</b>, <b>45g of fat</b>, and a total of <b>634 calories</b>. It is brought to you by Foodista. 1 person has tried and liked this recipe. If you have pineapple, juice of lime, about pepper corns, and a few other ingredients on hand, you can make it. From preparation to the plate, this recipe takes roughly <b>45 minutes</b>. All things considered, we decided this recipe <b>deserves a spoonacular score of 89%</b>. This score is super. Try <a href=\"https://spoonacular.com/recipes/zesty-spinach-mushroom-salad-369211\">Zesty Spinach Mushroom Salad</a>, <a href=\"https://spoonacular.com/recipes/zesty-lentil-spinach-salad-800143\">Zesty Lentil Spinach Salad</a>, and <a href=\"https://spoonacular.com/recipes/zesty-spinach-dip-380675\">Zesty Spinach Dip</a> for similar recipes.", "servings": 1, "instructions": ["Step 1: Wash the spinach thoroughly and chop it up into bite sized slivers.Chop the spring onion and pine apple in roughly the same sized portions as the spinach.Clean and peel the pomegranate to get to the red nuggets inside.", "Step 2: Mix all the salad ingredients.Make a dressing of olive oil, lime juice and black pepper (ground up).", "Step 3: Pour evenly over the salad.", "Step 4: Mix well."], "calories": 634, "fat": 44, "carbohydrates": 62, "protein": 6}, {"title": "Quinoa Stuffed Mushrooms", "ingredients": ["cooking oil", "mushrooms", "garlic", "quinoa", "onion", "sauce", "water", "salt", "salt and pepper", "bell pepper", "garlic salt", "pepper", "tomato", "olive oil"], "health_score": 81, "missing_ingredients": [], "vegetarian": true, "gluten_free": true, "ready_in_minutes": 45, "price_per_serving": 463.69, "source_url": "http://www.foodista.com/recipe/HZTZ37BH/quinoa-stuffed-mushrooms", "image_url": "https://spoonacular.com/recipeImages/657682-312x231.jpg", "summary": "Quinoa Stuffed Mushrooms is a hor d'oeuvre that serves 2. For <b>$4.64 per serving</b>, this recipe <b>covers 46%</b> of your daily requirements of vitamins and minerals. Watching your figure? This gluten free, dairy free, lacto ovo vegetarian, and vegan recipe has <b>577 calories</b>, <b>22g of protein</b>, and <b>21g of fat</b> per serving. This recipe from Foodista requires quinoa, tomato, garlic powder, and onion. 1 person found this recipe to be flavorful and satisfying. From preparation to the plate, this recipe takes about <b>45 minutes</b>. With a spoonacular <b>score of 89%</b>, this dish is outstanding. Try <a href=\"https://spoonacular.com/recipes/quinoa-stuffed-mushrooms-560679\">Quinoa Stuffed Mushrooms</a>, <a href=\"https://spoonacular.com/recipes/quinoa-stuffed-portobella-mushrooms-with-burrata-475948\">Quinoa Stuffed Portobella Mushrooms with Burrata</a>, and <a href=\"https://spoonacular.com/recipes/pizza-quinoa-stuffed-portabella-mushrooms-495213\">Pizza Quinoa Stuffed Portabella Mushrooms</a> for similar recipes.", "servings": 2, "instructions": ["Step 1: Preheat oven to 375F.In medium sauce pan, add quinoa and water to boil (add optional pinch of salt), cover with tight fitting lid and turn heat down to simmer. Cook 15 minutes.Meanwhile, in medium saute pan, heat cooking oil and saute chopped mushroom stems, garlic and onion over medium heat.", "Step 2: Add a dash of salt and pepper. Cook for about 5-7 minutes, stirring.", "Step 3: Add diced tomato, bell pepper, and onion mixture to quinoa along with salt, pepper &amp; garlic salt.", "Step 4: Mix thoroughly and let it finish cooking with the lid on.Prepare baking sheet with parchment paper or tin foil and spray with non-stick spray.", "Step 5: Lay washed and dried mushroom caps out on sheet and drizzle with olive oil and sprinkle with salt &amp; pepper.Carefully stuff each mushroom cap with quinoa mixture and bake in oven for about 20-25 minutes."], "calories": 577, "fat": 20, "carbohydrates": 81, "protein": 21}, {"title": "Avocado and Orange Salad With Orange-Ginger Dressing", "ingredients": ["orange slices", "avocado", "orange", "juice", "spring onions", "salt", "salt and pepper"], "health_score": 60, "missing_ingredients": [], "vegetarian": true, "gluten_free": true, "ready_in_minutes": 45, "price_per_serving": 222.04, "source_url": "https://www.foodista.com/recipe/YPMB288Y/avocado-and-orange-salad-with-orange-ginger-dressing", "image_url": "https://spoonacular.com/recipeImages/633126-312x231.jpg", "summary": "You can never have too many hor d'oeuvre recipes, so give Avocado and Orange Salad With Orange-Ginger Dressing a try. For <b>$2.22 per serving</b>, this recipe <b>covers 24%</b> of your daily requirements of vitamins and minerals. One serving contains <b>501 calories</b>, <b>6g of protein</b>, and <b>40g of fat</b>. This recipe serves 4. This recipe from Foodista requires agave syrup, oranges, green onions, and ginger paste. 4 people were impressed by this recipe. From preparation to the plate, this recipe takes approximately <b>45 minutes</b>. It is a good option if you're following a <b>gluten free, dairy free, lacto ovo vegetarian, and vegan</b> diet. Overall, this recipe earns a <b>tremendous spoonacular score of 88%</b>. Similar recipes include <a href=\"https://spoonacular.com/recipes/avocado-and-orange-salad-with-orange-ginger-dressing-1295061\">Avocado and Orange Salad With Orange-Ginger Dressing</a>, <a href=\"https://spoonacular.com/recipes/brussel-sprouts-salad-with-orange-ginger-dressing-496200\">Brussel Sprouts Salad with Orange Ginger Dressing</a>, and <a href=\"https://spoonacular.com/recipes/chicken-and-mango-salad-with-ginger-orange-dressing-21105\">Chicken and Mango Salad with Ginger-Orange Dressing</a>.", "servings": 4, "instructions": ["Step 1: Arrange the avocado and orange slices overlapping each other on a platter. Squeeze over the juice from the orange left after segmenting the pieces.", "Step 2: Sprinkle over the spring onions and some salt over the salad. Cover with cling film and refrigerate until ready to serve.", "Step 3: Blend all the dressing ingredients together. Season to taste with salt and pepper. Before serving pour the dressing over the salad."], "calories": 501, "fat": 40, "carbohydrates": 39, "protein": 5}, {"title": "Cashew-Chili Portabello", "ingredients": ["brown rice", "olive oil", "portobello mushrooms", "fresh basil", "pepper", "juice", "lemon", "water", "rice", "salt", "cooking oil", "minced garlic", "chili pepper", "garlic", "red pepper", "soy sauce", "agave", "green onions", "cashews", "vegetable", "arrowroot", "cilantro"], "health_score": 56, "missing_ingredients": [], "vegetarian": true, "gluten_free": true, "ready_in_minutes": 45, "price_per_serving": 212.8, "source_url": "http://www.foodista.com/recipe/N3RKYKNM/cashew-chili-portabello", "image_url": "https://spoonacular.com/recipeImages/637265-312x231.jpg", "summary": "If you want to add more <b>gluten free, dairy free, lacto ovo vegetarian, and vegan</b> recipes to your recipe box, Cashew-Chili Portabello might be a recipe you should try. This recipe makes 4 servings with <b>461 calories</b>, <b>12g of protein</b>, and <b>24g of fat</b> each. For <b>$2.13 per serving</b>, this recipe <b>covers 26%</b> of your daily requirements of vitamins and minerals. This recipe is typical of American cuisine. It works well as a hor d'oeuvre. This recipe from Foodista has 1 fans. Head to the store and pick up bell pepper, extra virgin olive oil, portabello mushrooms, and a few other things to make it today. From preparation to the plate, this recipe takes about <b>45 minutes</b>. With a spoonacular <b>score of 85%</b>, this dish is spectacular. Users who liked this recipe also liked <a href=\"https://spoonacular.com/recipes/cashew-chicken-chili-581817\">Cashew Chicken Chili</a>, <a href=\"https://spoonacular.com/recipes/vegetarian-chili-with-cilantro-lime-cashew-sour-cream-573766\">Vegetarian Chili with Cilantro-Lime Cashew Sour Cream</a>, and <a href=\"https://spoonacular.com/recipes/meat-lite-black-bean-and-cashew-chicken-chili-208799\">Meat Lite: Black Bean and Cashew Chicken Chili</a>.", "servings": 4, "instructions": ["Step 1: Fix brown rice by cooking in 1 tsp. olive oil until lightly browned.", "Step 2: Place 2 basil leaves on top of rice and add 2 cups water all at once.  Quickly put on lid and bring to boil.  Turn down heat to simmer until all water has evaporated (around 40 minutes).  Fluff rice and add juice of 1/2 lemon and lightly salt &amp; pepper to taste.While rice is cooking cut portabello mushrooms into cubes.  Set aside.Preheat a wok and then heat the 2 tbsp. oil.", "Step 3: Add minced garlic and dried chopped chilies to the wok and stir-fry over a medium heat until golden.  Do not let the garlic burn.", "Step 4: Add the portabello mushrooms and stir-fry until it is cooked, then add the red bell pepper.Stir in the shoyou (soy sauce) and agave.", "Step 5: Add the green onions and cashew nuts.  Stir-fry for 1-2 minutes more, until heated through. Push vegetables to side of wok to expose liquid.", "Step 6: Whisk in 1 tsp. - 1 Tbsp. arrowroot powder to thicken liquid.To serve:  With a very small dipping bowl for a mold, pack with brown rice  and empty onto plate (see picture above).  On top of rice place stir-fry vegetables and garnish with cilantro."], "calories": 460, "fat": 23, "carbohydrates": 54, "protein": 11}], "Wednesday": [{"title": "Kashmiri Rogan Josh", "ingredients": ["fennel seeds", "yogurt", "asafoetida", "cinnamon", "ground cayenne pepper", "paprika", "clove", "meat", "salt", "cooking oil", "fennel", "ginger", "broth", "water", "garam masala", "brown sauce"], "health_score": 20, "missing_ingredients": [], "vegetarian": false, "gluten_free": true, "ready_in_minutes": 45, "price_per_serving": 416.84, "source_url": "http://www.foodista.com/recipe/SQPFZHZF/kashmiri-rogan-josh", "image_url": "https://spoonacular.com/recipeImages/648774-312x231.jpg", "summary": "You can never have too many main course recipes, so give Kashmiri Rogan Josh a try. This recipe serves 6 and costs $4.17 per serving. One portion of this dish contains about <b>44g of protein</b>, <b>63g of fat</b>, and a total of <b>778 calories</b>. Not a lot of people made this recipe, and 1 would say it hit the spot. This recipe from Foodista requires pch asafetida, yogurt, cayenne pepper, and ginger. It is a <b>pretty expensive</b> recipe for fans of Indian food. It is a good option if you're following a <b>gluten free and ketogenic</b> diet. From preparation to the plate, this recipe takes about <b>45 minutes</b>. Taking all factors into account, this recipe <b>earns a spoonacular score of 71%</b>, which is solid. If you like this recipe, take a look at these similar recipes: <a href=\"https://spoonacular.com/recipes/kashmiri-rogan-josh-1199343\">Kashmiri Rogan Josh</a>, <a href=\"https://spoonacular.com/recipes/rogan-josh-kashmiri-lamb-curry-97325\">Rogan Josh (Kashmiri Lamb Curry)</a>, and <a href=\"https://spoonacular.com/recipes/kashmiri-rogan-josh-indian-mutton-lamb-curry-98123\">Kashmiri Rogan Josh (Indian Mutton/ Lamb Curry)</a>.", "servings": 6, "instructions": ["Step 1: Grind the fennel seeds until find.", "Step 2: Put the yogurt in a bowl and beat it with a fork until smooth and creamy.", "Step 3: Heat the oil in a large pot over a high flame. When hot, put in the cinnamon and cloves.A second later, put in the ground asafetida. A second after that, put in all the meat and the salt.Stir the meat an cook, still on a high flame for about 5 minutes. Now put in the paprika and cayenne and give the meat a good stir. Slowly add the yogurt, a small amount at a time, stirring the meat vigorously as you do so.", "Step 4: Add all the yogurt this way. Keep cooking on high heat until all liquid has boiled away and the meat pieces have browned slightly.", "Step 5: Add the fennel and ginger. Give the meat some more good stirs. Now put in the water or broth, cover so as to leave the lid very slightly ajar, and cook on medium heat for 30 minutes.Cover completely and cook on low heat for another 45 minutes or until meat is tinder. Stir a few times as the meat cooks, making sure that there is always some liquid in the pot.", "Step 6: Remove the lid and add the garam masala. You should have a thick, reddish brown sauce. If it is too thin, boil away some of the liquid."], "calories": 778, "fat": 62, "carbohydrates": 7, "protein": 44}, {"title": "Curry Mussels", "ingredients": ["olive oil", "onion", "cayenne pepper", "white wine", "pepper", "salt", "mussels", "curry powder", "sauce", "parsley"], "health_score": 80, "missing_ingredients": [], "vegetarian": false, "gluten_free": true, "ready_in_minutes": 45, "price_per_serving": 571.82, "source_url": "https://www.foodista.com/recipe/4ZL4SYFD/curry-mussels", "image_url": "https://spoonacular.com/recipeImages/641128-312x231.jpg", "summary": "Curry Mussels is a <b>gluten free, primal, and pescatarian</b> hor d'oeuvre. One portion of this dish contains around <b>64g of protein</b>, <b>33g of fat</b>, and a total of <b>743 calories</b>. For <b>$5.72 per serving</b>, this recipe <b>covers 51%</b> of your daily requirements of vitamins and minerals. This recipe serves 2. This recipe from Foodista has 1 fans. If you have crème fraiche, cayenne pepper, parsley, and a few other ingredients on hand, you can make it. It is an <b>expensive</b> recipe for fans of Indian food. From preparation to the plate, this recipe takes approximately <b>45 minutes</b>. With a spoonacular <b>score of 89%</b>, this dish is amazing. If you like this recipe, take a look at these similar recipes: <a href=\"https://spoonacular.com/recipes/coconut-curry-mussels-247054\">Coconut Curry Mussels</a>, <a href=\"https://spoonacular.com/recipes/coconut-curry-mussels-568548\">Coconut Curry Mussels</a>, and <a href=\"https://spoonacular.com/recipes/coconut-curry-mussels-54272\">Coconut Curry Mussels</a>.", "servings": 2, "instructions": ["Step 1: In a big pot or cocotte, put in olive oil and onion. Fry the onions until soft but not brown.", "Step 2: Then, put in white wine, parseley, salt, pepper, and cayenne pepper.", "Step 3: Stir for a few minutes before putting the mussels in the pot.", "Step 4: Put the lid on and cook the mussels for about 2-3 minutes, shaking the pan occasionally.", "Step 5: Use tongs to lift out the mussels as they open, putting them into a warm dish. Throw away any mussels that havent opened after 3 minutes.", "Step 6: Strain the liquid through a fine sieve into a clean saucepan, leaving behind any grit or sand.", "Step 7: Bring to the boil and  boil for 2 minutes.", "Step 8: Add the curry powder and crme fraiche, stir. Reheat the sauce without boiling and let the sauce thicken.", "Step 9: Serve the mussels in individual bowls with the sauce poured over.", "Step 10: Sprinkle with some parsley."], "calories": 742, "fat": 33, "carbohydrates": 31, "protein": 63}, {"title": "Crock-Pot: Asian-Style Country Ribs with Black Bean Garlic Sauce", "ingredients": ["snow peas", "garlic", "sauce", "ribs", "rice", "cooking spray", "pork", "corn starch", "soy sauce", "ginger", "pepper", "honey", "mirin", "sesame oil", "green onions"], "health_score": 12, "missing_ingredients": [], "vegetarian": false, "gluten_free": false, "ready_in_minutes": 45, "price_per_serving": 234.99, "source_url": "http://oneperfectbite.blogspot.com/2008/10/crock-pot-asian-style-country-ribs-with.html", "image_url": "https://spoonacular.com/recipeImages/735820-312x231.jpg", "summary": "Crock-Pot: Asian-Style Country Ribs with Black Bean Garlic Sauce could be just the <b>dairy free and ketogenic</b> recipe you've been looking for. One serving contains <b>732 calories</b>, <b>39g of protein</b>, and <b>58g of fat</b>. This recipe serves 4. For <b>$2.35 per serving</b>, this recipe <b>covers 25%</b> of your daily requirements of vitamins and minerals. Many people really liked this main course. If you have soy salt, country, ginger root, and a few other ingredients on hand, you can make it. 912 people have made this recipe and would make it again. It is a <b>rather inexpensive</b> recipe for fans of Asian food. It is brought to you by oneperfectbite.blogspot.com. From preparation to the plate, this recipe takes roughly <b>45 minutes</b>. Overall, this recipe earns a <b>good spoonacular score of 75%</b>. Users who liked this recipe also liked <a href=\"https://spoonacular.com/recipes/crock-pot-asian-style-country-ribs-with-black-bean-garlic-sauce-1242665\">Crock-Pot: Asian-Style Country Ribs with Black Bean Garlic Sauce</a>, <a href=\"https://spoonacular.com/recipes/crock-pot-indonesian-style-country-ribs-114372\">Crock Pot Indonesian Style Country Ribs</a>, and <a href=\"https://spoonacular.com/recipes/crock-pot-bbq-country-style-ribs-484544\">Crock Pot BBQ Country Style Ribs</a>.", "servings": 4, "instructions": ["Step 1: This crock-pot entre is really, really good. It takes 10 minutes to prepare, is made from ingredients that are readily available and is a bargain when you consider the number of servings it provides.  One caution -  you'll have mush with  Asian flavor if you cook this for more than 5 to 6 hours. The recipe is adapted from \"Slow Cooker Recipes for All Occasions\",  a Rival Crock-Pot publication.", "Step 2: Served with rice and snow peas you have the makings of a minor feast that you'll repeat often. My family loves this dish. I think yours will, too. This, by the way, is a wonderful recipe for novice cooks. If you have a willing teen, let them have a go at it.Asian-Style Country Ribs with Black Bean Garlic Sauce", "Step 1: Spray interior of slow cooker with nonstick cooking spray.", "Step 2: Place pork cubes in slow cooker.", "Step 3: Combine black bean garlic sauce, soy sauce, mirin, honey, ginger, garlic, pepper and cornstarch in a small bowl; stir to dissolve cornstarch.", "Step 4: Pour over ribs.", "Step 5: Cook, covered, on LOW setting for 5 to 6 hours until ribs are tender but still hold their shape.", "Step 6: Transfer ribs to a rimmed serving platter; tent with foil to keep warm. Strain liquid into a small pan. Bring liquid to a boil over medium-high heat; cook until mixture begins to thicken and is reduced by half. Stir in sesame oil.", "Step 7: Add sauce and 1/4 cup scallions to pork cubes.", "Step 8: Mix well.", "Step 9: Garnish with reserved 2 tablespoons scallions."], "calories": 732, "fat": 58, "carbohydrates": 11, "protein": 38}, {"title": "Bibimbab (Korean Rice w Vegetables & Beef)", "ingredients": ["rice", "vegetable", "water", "olive oil", "spinach", "carrot", "garlic", "red pepper flakes", "gochugaru", "cucumber", "soy sauce", "beef", "egg yolk", "egg", "gochujang", "sriracha", "lettuce leaf", "sesame seeds", "sesame oil", "meat"], "health_score": 46, "missing_ingredients": [], "vegetarian": false, "gluten_free": true, "ready_in_minutes": 45, "price_per_serving": 480.18, "source_url": "http://www.foodista.com/recipe/7SFVMHXW/bibimbab-korean-rice-w-vegetables-beef", "image_url": "https://spoonacular.com/recipeImages/634965-312x231.jpg", "summary": "Forget going out to eat or ordering takeout every time you crave Korean food. Try making Bibimbab (Korean Rice w Vegetables & Beef) at home. This gluten free and dairy free recipe serves 4 and costs <b>$4.8 per serving</b>. This main course has <b>680 calories</b>, <b>40g of protein</b>, and <b>32g of fat</b> per serving. If you have garlic clove, sesame oil, sesame seeds, and a few other ingredients on hand, you can make it. This recipe from Foodista has 2 fans. From preparation to the plate, this recipe takes roughly <b>45 minutes</b>. Taking all factors into account, this recipe <b>earns a spoonacular score of 83%</b>, which is great. <a href=\"https://spoonacular.com/recipes/bibimbab-korean-rice-w-vegetables-beef-1297907\">Bibimbab (Korean Rice w Vegetables & Beef)</a>, <a href=\"https://spoonacular.com/recipes/korean-bibimbab-rice-w-vegetables-beef-1507229\">Korean Bibimbab (Rice w Vegetables & Beef)</a>, and <a href=\"https://spoonacular.com/recipes/korean-bibimbab-rice-w-vegetables-beef-649031\">Korean Bibimbab (Rice w Vegetables & Beef)</a> are very similar to this recipe.", "servings": 4, "instructions": ["Step 1: Cook rice according to package directions.", "Step 2: Cut vegetables into matchstick pieces and set aside for sauteing.3.In a large non-stick pan/skillet, bring 2 cups water to a boil.", "Step 3: Add spinach and cook, stirring constantly until wilted; drain. When cool enough to handle, squeeze spinach dry into a ball.4.Wipe out skillet; heat 1 tsp olive oil over medium-high.", "Step 4: Add carrots and cook until soft, 3 minutes.", "Step 5: Add garlic and cook until fragrant or semi-browned, 1 minute.", "Step 6: Add cucumber slices mixed with gochugaru (red pepper flakes).", "Step 7: Combine spinach and soy sauce; set aside until serving.", "Step 8: Add thinly sliced beef to non-stick pan and heat until browned. Wipe down with napkin.", "Step 9: Heat 1 tsp olive oil in non-stick pan over medium-high.", "Step 10: Add eggs and cook until whites are set and yolks are still runny, about 5 minutes.7.Divide rice among four bowls; top with vegetables and eggs.", "Step 11: Drizzle each with sesame oil, sprinkle with sesame seeds. Top with gochujang (red pepper paste) or Sriracha sauce as substitute.*Bibimbab and its main ingredients (usually rice and vegetables) can be chosen at one's preference. This is the main reason why bibimbab is so appealing; it suits vegetarians, dieters, health-conscience eaters, and even meat-lovers, who are more than welcome to add beef to their liking. For us, since we usually have rice available to eat at all times, we simply slice up any available vegetables or lettuce leaf varieties in the fridge for an \"instant\" and very satisfying bibimbab meal. So feel free to deviate from the original recipe!"], "calories": 679, "fat": 31, "carbohydrates": 60, "protein": 39}]}