[
    {
        "title": "Kashmiri Rogan Josh",
        "ingredients": [
            "fennel seeds",
            "yogurt",
            "asafoetida",
            "cinnamon",
            "ground cayenne pepper",
            "paprika",
            "clove",
            "meat",
            "salt",
            "cooking oil",
            "fennel",
            "ginger",
            "broth",
            "water",
            "garam masala",
            "brown sauce"
        ],
        "health_score": 20,
        "missing_ingredients": [],
        "vegetarian": false,
        "gluten_free": true,
        "ready_in_minutes": 45,
        "price_per_serving": 416.84,
        "source_url": "http://www.foodista.com/recipe/SQPFZHZF/kashmiri-rogan-josh",
        "image_url": "https://spoonacular.com/recipeImages/648774-312x231.jpg",
        "summary": "You can never have too many main course recipes, so give Kashmiri Rogan Josh a try. This recipe serves 6 and costs $4.17 per serving. One portion of this dish contains about <b>44g of protein</b>, <b>63g of fat</b>, and a total of <b>778 calories</b>. Not a lot of people made this recipe, and 1 would say it hit the spot. This recipe from Foodista requires pch asafetida, yogurt, cayenne pepper, and ginger. It is a <b>pretty expensive</b> recipe for fans of Indian food. It is a good option if you're following a <b>gluten free and ketogenic</b> diet. From preparation to the plate, this recipe takes about <b>45 minutes</b>. Taking all factors into account, this recipe <b>earns a spoonacular score of 71%</b>, which is solid. If you like this recipe, take a look at these similar recipes: <a href=\"https://spoonacular.com/recipes/kashmiri-rogan-josh-1199343\">Kashmiri Rogan Josh</a>, <a href=\"https://spoonacular.com/recipes/rogan-josh-kashmiri-lamb-curry-97325\">Rogan Josh (Kashmiri Lamb Curry)</a>, and <a href=\"https://spoonacular.com/recipes/kashmiri-rogan-josh-indian-mutton-lamb-curry-98123\">Kashmiri Rogan Josh (Indian Mutton/ Lamb Curry)</a>.",
        "servings": 6,
        "instructions": [
            "Step 1: Grind the fennel seeds until find.",
            "Step 2: Put the yogurt in a bowl and beat it with a fork until smooth and creamy.",
            "Step 3: Heat the oil in a large pot over a high flame. When hot, put in the cinnamon and cloves.A second later, put in the ground asafetida. A second after that, put in all the meat and the salt.Stir the meat an cook, still on a high flame for about 5 minutes. Now put in the paprika and cayenne and give the meat a good stir. Slowly add the yogurt, a small amount at a time, stirring the meat vigorously as you do so.",
            "Step 4: Add all the yogurt this way. Keep cooking on high heat until all liquid has boiled away and the meat pieces have browned slightly.",
            "Step 5: Add the fennel and ginger. Give the meat some more good stirs. Now put in the water or broth, cover so as to leave the lid very slightly ajar, and cook on medium heat for 30 minutes.Cover completely and cook on low heat for another 45 minutes or until meat is tinder. Stir a few times as the meat cooks, making sure that there is always some liquid in the pot.",
            "Step 6: Remove the lid and add the garam masala. You should have a thick, reddish brown sauce. If it is too thin, boil away some of the liquid."
        ],
        "calories": 778,
        "fat": 62,
        "carbohydrates": 7,
        "protein": 44
    },
    {
        "title": "Curry Mussels",
        "ingredients": [
            "olive oil",
            "onion",
            "cayenne pepper",
            "white wine",
            "pepper",
            "salt",
            "mussels",
            "curry powder",
            "sauce",
            "parsley"
        ],
        "health_score": 80,
        "missing_ingredients": [],
        "vegetarian": false,
        "gluten_free": true,
        "ready_in_minutes": 45,
        "price_per_serving": 571.82,
        "source_url": "https://www.foodista.com/recipe/4ZL4SYFD/curry-mussels",
        "image_url": "https://spoonacular.com/recipeImages/641128-312x231.jpg",
        "summary": "Curry Mussels is a <b>gluten free, primal, and pescatarian</b> hor d'oeuvre. One portion of this dish contains around <b>64g of protein</b>, <b>33g of fat</b>, and a total of <b>743 calories</b>. For <b>$5.72 per serving</b>, this recipe <b>covers 51%</b> of your daily requirements of vitamins and minerals. This recipe serves 2. This recipe from Foodista has 1 fans. If you have crème fraiche, cayenne pepper, parsley, and a few other ingredients on hand, you can make it. It is an <b>expensive</b> recipe for fans of Indian food. From preparation to the plate, this recipe takes approximately <b>45 minutes</b>. With a spoonacular <b>score of 89%</b>, this dish is amazing. If you like this recipe, take a look at these similar recipes: <a href=\"https://spoonacular.com/recipes/coconut-curry-mussels-247054\">Coconut Curry Mussels</a>, <a href=\"https://spoonacular.com/recipes/coconut-curry-mussels-568548\">Coconut Curry Mussels</a>, and <a href=\"https://spoonacular.com/recipes/coconut-curry-mussels-54272\">Coconut Curry Mussels</a>.",
        "servings": 2,
        "instructions": [
            "Step 1: In a big pot or cocotte, put in olive oil and onion. Fry the onions until soft but not brown.",
            "Step 2: Then, put in white wine, parseley, salt, pepper, and cayenne pepper.",
            "Step 3: Stir for a few minutes before putting the mussels in the pot.",
            "Step 4: Put the lid on and cook the mussels for about 2-3 minutes, shaking the pan occasionally.",
            "Step 5: Use tongs to lift out the mussels as they open, putting them into a warm dish. Throw away any mussels that havent opened after 3 minutes.",
            "Step 6: Strain the liquid through a fine sieve into a clean saucepan, leaving behind any grit or sand.",
            "Step 7: Bring to the boil and  boil for 2 minutes.",
            "Step 8: Add the curry powder and crme fraiche, stir. Reheat the sauce without boiling and let the sauce thicken.",
            "Step 9: Serve the mussels in individual bowls with the sauce poured over.",
            "Step 10: Sprinkle with some parsley."
        ],
        "calories": 742,
        "fat": 33,
        "carbohydrates": 31,
        "protein": 63
    },
    {
        "title": "Crock-Pot: Asian-Style Country Ribs with Black Bean Garlic Sauce",
        "ingredients": [
            "snow peas",
            "garlic",
            "sauce",
            "ribs",
            "rice",
            "cooking spray",
            "pork",
            "corn starch",
            "soy sauce",
            "ginger",
            "pepper",
            "honey",
            "mirin",
            "sesame oil",
            "green onions"
        ],
        "health_score": 12,
        "missing_ingredients": [],
        "vegetarian": false,
        "gluten_free": false,
        "ready_in_minutes": 45,
        "price_per_serving": 234.99,
        "source_url": "http://oneperfectbite.blogspot.com/2008/10/crock-pot-asian-style-country-ribs-with.html",
        "image_url": "https://spoonacular.com/recipeImages/735820-312x231.jpg",
        "summary": "Crock-Pot: Asian-Style Country Ribs with Black Bean Garlic Sauce could be just the <b>dairy free and ketogenic</b> recipe you've been looking for. One serving contains <b>732 calories</b>, <b>39g of protein</b>, and <b>58g of fat</b>. This recipe serves 4. For <b>$2.35 per serving</b>, this recipe <b>covers 25%</b> of your daily requirements of vitamins and minerals. Many people really liked this main course. If you have soy salt, country, ginger root, and a few other ingredients on hand, you can make it. 912 people have made this recipe and would make it again. It is a <b>rather inexpensive</b> recipe for fans of Asian food. It is brought to you by oneperfectbite.blogspot.com. From preparation to the plate, this recipe takes roughly <b>45 minutes</b>. Overall, this recipe earns a <b>good spoonacular score of 75%</b>. Users who liked this recipe also liked <a href=\"https://spoonacular.com/recipes/crock-pot-asian-style-country-ribs-with-black-bean-garlic-sauce-1242665\">Crock-Pot: Asian-Style Country Ribs with Black Bean Garlic Sauce</a>, <a href=\"https://spoonacular.com/recipes/crock-pot-indonesian-style-country-ribs-114372\">Crock Pot Indonesian Style Country Ribs</a>, and <a href=\"https://spoonacular.com/recipes/crock-pot-bbq-country-style-ribs-484544\">Crock Pot BBQ Country Style Ribs</a>.",
        "servings": 4,
        "instructions": [
            "Step 1: This crock-pot entre is really, really good. It takes 10 minutes to prepare, is made from ingredients that are readily available and is a bargain when you consider the number of servings it provides.  One caution -  you'll have mush with  Asian flavor if you cook this for more than 5 to 6 hours. The recipe is adapted from \"Slow Cooker Recipes for All Occasions\",  a Rival Crock-Pot publication.",
            "Step 2: Served with rice and snow peas you have the makings of a minor feast that you'll repeat often. My family loves this dish. I think yours will, too. This, by the way, is a wonderful recipe for novice cooks. If you have a willing teen, let them have a go at it.Asian-Style Country Ribs with Black Bean Garlic Sauce",
            "Step 1: Spray interior of slow cooker with nonstick cooking spray.",
            "Step 2: Place pork cubes in slow cooker.",
            "Step 3: Combine black bean garlic sauce, soy sauce, mirin, honey, ginger, garlic, pepper and cornstarch in a small bowl; stir to dissolve cornstarch.",
            "Step 4: Pour over ribs.",
            "Step 5: Cook, covered, on LOW setting for 5 to 6 hours until ribs are tender but still hold their shape.",
            "Step 6: Transfer ribs to a rimmed serving platter; tent with foil to keep warm. Strain liquid into a small pan. Bring liquid to a boil over medium-high heat; cook until mixture begins to thicken and is reduced by half. Stir in sesame oil.",
            "Step 7: Add sauce and 1/4 cup scallions to pork cubes.",
            "Step 8: Mix well.",
            "Step 9: Garnish with reserved 2 tablespoons scallions."
        ],
        "calories": 732,
        "fat": 58,
        "carbohydrates": 11,
        "protein": 38
    },
    {
        "title": "Bibimbab (Korean Rice w Vegetables & Beef)",
        "ingredients": [
            "rice",
            "vegetable",
            "water",
            "olive oil",
            "spinach",
            "carrot",
            "garlic",
            "red pepper flakes",
            "gochugaru",
            "cucumber",
            "soy sauce",
            "beef",
            "egg yolk",
            "egg",
            "gochujang",
            "sriracha",
            "lettuce leaf",
            "sesame seeds",
            "sesame oil",
            "meat"
        ],
        "health_score": 46,
        "missing_ingredients": [],
        "vegetarian": false,
        "gluten_free": true,
        "ready_in_minutes": 45,
        "price_per_serving": 480.18,
        "source_url": "http://www.foodista.com/recipe/7SFVMHXW/bibimbab-korean-rice-w-vegetables-beef",
        "image_url": "https://spoonacular.com/recipeImages/634965-312x231.jpg",
        "summary": "Forget going out to eat or ordering takeout every time you crave Korean food. Try making Bibimbab (Korean Rice w Vegetables & Beef) at home. This gluten free and dairy free recipe serves 4 and costs <b>$4.8 per serving</b>. This main course has <b>680 calories</b>, <b>40g of protein</b>, and <b>32g of fat</b> per serving. If you have garlic clove, sesame oil, sesame seeds, and a few other ingredients on hand, you can make it. This recipe from Foodista has 2 fans. From preparation to the plate, this recipe takes roughly <b>45 minutes</b>. Taking all factors into account, this recipe <b>earns a spoonacular score of 83%</b>, which is great. <a href=\"https://spoonacular.com/recipes/bibimbab-korean-rice-w-vegetables-beef-1297907\">Bibimbab (Korean Rice w Vegetables & Beef)</a>, <a href=\"https://spoonacular.com/recipes/korean-bibimbab-rice-w-vegetables-beef-1507229\">Korean Bibimbab (Rice w Vegetables & Beef)</a>, and <a href=\"https://spoonacular.com/recipes/korean-bibimbab-rice-w-vegetables-beef-649031\">Korean Bibimbab (Rice w Vegetables & Beef)</a> are very similar to this recipe.",
        "servings": 4,
        "instructions": [
            "Step 1: Cook rice according to package directions.",
            "Step 2: Cut vegetables into matchstick pieces and set aside for sauteing.3.In a large non-stick pan/skillet, bring 2 cups water to a boil.",
            "Step 3: Add spinach and cook, stirring constantly until wilted; drain. When cool enough to handle, squeeze spinach dry into a ball.4.Wipe out skillet; heat 1 tsp olive oil over medium-high.",
            "Step 4: Add carrots and cook until soft, 3 minutes.",
            "Step 5: Add garlic and cook until fragrant or semi-browned, 1 minute.",
            "Step 6: Add cucumber slices mixed with gochugaru (red pepper flakes).",
            "Step 7: Combine spinach and soy sauce; set aside until serving.",
            "Step 8: Add thinly sliced beef to non-stick pan and heat until browned. Wipe down with napkin.",
            "Step 9: Heat 1 tsp olive oil in non-stick pan over medium-high.",
            "Step 10: Add eggs and cook until whites are set and yolks are still runny, about 5 minutes.7.Divide rice among four bowls; top with vegetables and eggs.",
            "Step 11: Drizzle each with sesame oil, sprinkle with sesame seeds. Top with gochujang (red pepper paste) or Sriracha sauce as substitute.*Bibimbab and its main ingredients (usually rice and vegetables) can be chosen at one's preference. This is the main reason why bibimbab is so appealing; it suits vegetarians, dieters, health-conscience eaters, and even meat-lovers, who are more than welcome to add beef to their liking. For us, since we usually have rice available to eat at all times, we simply slice up any available vegetables or lettuce leaf varieties in the fridge for an \"instant\" and very satisfying bibimbab meal. So feel free to deviate from the original recipe!"
        ],
        "calories": 679,
        "fat": 31,
        "carbohydrates": 60,
        "protein": 39
    }
]