[
    {
        "title": "Thai Savory Brown Fried Rice",
        "ingredients": [
            "brown rice",
            "rice",
            "olive oil",
            "filtered water",
            "fresh basil",
            "water",
            "cooking oil",
            "garlic",
            "arbol chile",
            "cashews",
            "coconut",
            "apple cider vinegar",
            "stevia",
            "shoyu",
            "flax egg",
            "flaxseed",
            "green beans",
            "bok choy",
            "lime wedge"
        ],
        "health_score": 46,
        "missing_ingredients": [],
        "vegetarian": true,
        "gluten_free": true,
        "ready_in_minutes": 45,
        "price_per_serving": 214.28,
        "source_url": "https://www.foodista.com/recipe/7C3JZV44/thai-savory-brown-fried-rice",
        "image_url": "https://spoonacular.com/recipeImages/663150-312x231.jpg",
        "summary": "You can never have too many Chinese recipes, so give Thai Savory Brown Fried Rice a try. One portion of this dish contains around <b>14g of protein</b>, <b>41g of fat</b>, and a total of <b>641 calories</b>. This gluten free, dairy free, lacto ovo vegetarian, and vegan recipe serves 4 and costs <b>$2.14 per serving</b>. 9 people found this recipe to be yummy and satisfying. It is brought to you by Foodista. If you have bragg liquid aminos, apple cider vinegar, green beans, and a few other ingredients on hand, you can make it. It works well as a main course. From preparation to the plate, this recipe takes approximately <b>45 minutes</b>. All things considered, we decided this recipe <b>deserves a spoonacular score of 86%</b>. This score is amazing. Similar recipes include <a href=\"https://spoonacular.com/recipes/savory-slow-cooker-brown-rice-and-lentils-525366\">Savory Slow Cooker Brown Rice and Lentils</a>, <a href=\"https://spoonacular.com/recipes/savory-indian-pancakes-with-lentils-brown-rice-and-cabbage-630342\">Savory Indian Pancakes with Lentils, Brown Rice and Cabbage</a>, and <a href=\"https://spoonacular.com/recipes/savory-indian-pancakes-with-lentils-brown-rice-and-cabbage-1197333\">Savory Indian Pancakes with Lentils, Brown Rice and Cabbage</a>.",
        "servings": 4,
        "instructions": [
            "Step 1: Make my Perfect Brown Rice recipe below.  While brown",
            "Step 2: rice is cooking prepare rest of meal.",
            "Step 3: PERFECT BROWN RICE",
            "Step 4: 1 cup uncooked brown rice",
            "Step 5: 1 tsp. olive oil",
            "Step 6: 2 cups filtered water",
            "Step 7: 2 basil leaves (optional)",
            "Step 8: Fix brown rice by cooking in 1 tsp. olive oil until lightly browned.",
            "Step 9: Place 2 basil leaves on top of rice and add 2 cups water all at once. Quickly put on lid and bring to boil. Turn down heat to simmer until all water has evaporated (around 40 minutes).",
            "Step 10: Heat oil in a wok or large frying pan.",
            "Step 11: Add the garlic and cook on medium until lightly golden.  Watch carefully so you do not burn garlic.",
            "Step 12: Add the red chili peppers, cashew nuts and toasted coconut.",
            "Step 13: Mix together stevia, Nama Shoyu and apple cider vinegar together.  Cook over medium heat for 1 minutes.",
            "Step 14: Push stir-fry to one side of pan and add flax on opposite end.  Cook and stir the flax egg for about a minute and then incorporate into stir-fry mixture.",
            "Step 15: Add the green beans, bok choy and brown rice to stir-fry.  Cook and stir on medium for another minute.  Bok Choy will be wilted, but green beans will still be a bit crunchy.",
            "Step 16: Spoon into serving dish and add lime wedge on side for squeezing over rice."
        ],
        "calories": 641,
        "fat": 41,
        "carbohydrates": 60,
        "protein": 13
    },
    {
        "title": "Mango Fried Rice",
        "ingredients": [
            "chicken stock",
            "vegetable",
            "whole chicken",
            "pepper",
            "water",
            "rice",
            "cooking oil",
            "seasoning cube",
            "mango"
        ],
        "health_score": 45,
        "missing_ingredients": [],
        "vegetarian": false,
        "gluten_free": true,
        "ready_in_minutes": 45,
        "price_per_serving": 151.08,
        "source_url": "http://www.afrolems.com/2015/05/02/mango-fried-rice/",
        "image_url": "https://spoonacular.com/recipeImages/716311-312x231.jpg",
        "summary": "Mango Fried Rice is a Chinese main course. This recipe makes 2 servings with <b>486 calories</b>, <b>16g of protein</b>, and <b>4g of fat</b> each. For <b>$1.51 per serving</b>, this recipe <b>covers 19%</b> of your daily requirements of vitamins and minerals. Several people made this recipe, and 262 would say it hit the spot. Head to the store and pick up scotch bonnet pepper, seasoning cubes, rice, and a few other things to make it today. From preparation to the plate, this recipe takes roughly <b>45 minutes</b>. It is brought to you by Afrolems. It is a good option if you're following a <b>gluten free and dairy free</b> diet. Overall, this recipe earns a <b>great spoonacular score of 94%</b>. <a href=\"https://spoonacular.com/recipes/mango-pork-fried-rice-176007\">Mango-Pork Fried Rice</a>, <a href=\"https://spoonacular.com/recipes/thai-beef-mango-fried-rice-1326163\">Thai Beef & Mango Fried Rice</a>, and <a href=\"https://spoonacular.com/recipes/thai-chicken-and-mango-fried-rice-509300\">Thai Chicken and Mango Fried Rice</a> are very similar to this recipe.",
        "servings": 2,
        "instructions": [
            "Step 1: Wash your rice and bring to boil on medium heat with very little water as you are still going to cook it in chicken stock.Once the rice is slightly soft and the initial water has dried up, reduce the heat and pour in the chicken stock and cook till the chicken stock is all absorbed and has dried up. The chicken stock if freshly made will have some oil from the chicken so your rice does not need oil.Increase the heat and stir in the chopped vegetables and pepper.",
            "Step 2: Add your seasoning cube.Finally stir in your cubed mango and serve warm with any protein of your choice. I’d say chicken but it’s up to you."
        ],
        "calories": 486,
        "fat": 4,
        "carbohydrates": 95,
        "protein": 15
    },
    {
        "title": "Vietnamese Noodle Salad With Tofu",
        "ingredients": [
            "sesame oil",
            "marinade",
            "garlic",
            "ginger",
            "chili pepper",
            "tofu",
            "broccoli florets",
            "spring onions",
            "red pepper",
            "vegetable",
            "cucumber",
            "pasta",
            "peanuts",
            "carrot",
            "herbs",
            "water"
        ],
        "health_score": 32,
        "missing_ingredients": [],
        "vegetarian": false,
        "gluten_free": false,
        "ready_in_minutes": 45,
        "price_per_serving": 390.93,
        "source_url": "http://www.foodista.com/recipe/NXYGJ2H6/vietnamese-noodle-salad-with-tofu",
        "image_url": "https://spoonacular.com/recipeImages/664835-312x231.jpg",
        "summary": "If you want to add more <b>dairy free and pescatarian</b> recipes to your recipe box, Vietnamese Noodle Salad With Tofu might be a recipe you should try. One serving contains <b>816 calories</b>, <b>27g of protein</b>, and <b>40g of fat</b>. For <b>$3.91 per serving</b>, you get a main course that serves 2. This recipe from Foodista requires juice of lime, cane sugar, chili, and spring onion. This recipe is typical of Vietnamese cuisine. 1 person has tried and liked this recipe. From preparation to the plate, this recipe takes roughly <b>45 minutes</b>. All things considered, we decided this recipe <b>deserves a spoonacular score of 82%</b>. This score is excellent. Try <a href=\"https://spoonacular.com/recipes/vietnamese-tofu-noodle-lettuce-wraps-37288\">Vietnamese Tofu-noodle Lettuce Wraps</a>, <a href=\"https://spoonacular.com/recipes/vietnamese-beef-noodle-soup-with-asian-greens-okay-vietnamese-japanese-664830\">Vietnamese Beef-Noodle Soup With Asian Greens, Okay Vietnamese/japanese</a>, and <a href=\"https://spoonacular.com/recipes/vietnamese-beef-noodle-soup-with-asian-greens-okay-vietnamese-japanese-1469207\">Vietnamese Beef-Noodle Soup With Asian Greens, Okay Vietnamese/japanese</a> for similar recipes.",
        "servings": 2,
        "instructions": [
            "Step 1: The tofu: Slice up the tofu (3/4 cm thick slices) and marinade it over night (or at least for 2 hours) in soya, sesame oil, and sliced garlic gloves.The marinade: Finely chop chili, ginger, and garlic.",
            "Step 1: Heat up a large pan and fry the marinated tofu at medium heat untill golden brown. In a dish, pour boiled water over the broccoli florets and leave for 5 minutes before draining off excess water. Prepare the noodles according to the manufacturer. Finely chop the spring onion and remove the inner watery part of the cucumber. Slice up the carrot, cucumber, red pepper, and iceberg into fine screds and roughly chop both herbs and peanuts.Arrange in two large bowls. First iceberg, then noodles, vegetables, tofu, herbs, peanuts and marinade."
        ],
        "calories": 816,
        "fat": 39,
        "carbohydrates": 92,
        "protein": 26
    },
    {
        "title": "Healthier Pork Fried Rice",
        "ingredients": [
            "ginger",
            "water",
            "rice",
            "pork tenderloin",
            "garlic",
            "pepper",
            "onion",
            "pork",
            "salt",
            "green onions",
            "olive oil",
            "cooking oil",
            "peas and carrots",
            "vegetable",
            "egg",
            "soy sauce",
            "hoisin sauce",
            "sauce"
        ],
        "health_score": 25,
        "missing_ingredients": [],
        "vegetarian": false,
        "gluten_free": true,
        "ready_in_minutes": 45,
        "price_per_serving": 248.88,
        "source_url": "https://www.foodista.com/recipe/KY4LQ345/healthier-pork-fried-rice",
        "image_url": "https://spoonacular.com/recipeImages/646425-312x231.jpg",
        "summary": "The recipe Healthier Pork Fried Rice could satisfy your Chinese craving in roughly <b>45 minutes</b>. One serving contains <b>522 calories</b>, <b>28g of protein</b>, and <b>12g of fat</b>. For <b>$2.49 per serving</b>, this recipe <b>covers 32%</b> of your daily requirements of vitamins and minerals. This recipe serves 3. It works well as a rather inexpensive main course. 1 person were glad they tried this recipe. A mixture of eggs, green onion, hoisin, and a handful of other ingredients are all it takes to make this recipe so yummy. It is a good option if you're following a <b>gluten free and dairy free</b> diet. It is brought to you by Foodista. With a spoonacular <b>score of 65%</b>, this dish is solid. If you like this recipe, take a look at these similar recipes: <a href=\"https://spoonacular.com/recipes/pork-fried-rice-450394\">Pork Fried Rice</a>, <a href=\"https://spoonacular.com/recipes/pork-fried-rice-176011\">Pork Fried Rice</a>, and <a href=\"https://spoonacular.com/recipes/pork-fried-rice-1770807\">Pork Fried Rice</a>.",
        "servings": 3,
        "instructions": [
            "Step 1: Place 1 cup of rice, 2 cups of water ( or whatever the rice directions say) and the ginger slices in a medium pot. Bring to a boil, cover and them reduce heat to low. Simmer until rice is tender, about 20 minutes. Once done, take ginger slices out of pan.",
            "Step 2: Prepare pork: Meanwhile, preheat oven to 350 degrees Fahrenheit and a grill pan ( or grill) to high heat). Slice pork tenderloin into 1/2 inch strips and season strips with, garlic, onion, ginger, pepper and salt on both sides. Once the grill pan is hot, add the pork. Cook 3 minutes per side to get some good grill marks. Once done.",
            "Step 3: Place on baking sheet and in over for 2 minutes. Take out of oven set aside and let rest.",
            "Step 4: In a frying pan or large pan on medium high heat, add olive oil. Once oil is hot, add garlic, ginger and green onion, cooking until onion is tender, about 1 minute ( make sure to stir garlic so it does not burn).",
            "Step 5: Add peas and carrots, stir and cook until vegetables are tender about 3 minutes.",
            "Step 6: Add eggs over veggies and stir till scrambled, about 1 minute.",
            "Step 7: Add rice to pan. Gently fold rice in.",
            "Step 8: Remove from heat.",
            "Step 9: Add Pork, soy sauce and hoisin ( you may want to add more later, but go slow, it gets very strong quickly). Gently stir together till all rice is coated in sauce.",
            "Step 10: Serve and enjoy!"
        ],
        "calories": 522,
        "fat": 12,
        "carbohydrates": 75,
        "protein": 27
    }
]