{
    "username": "client1@gmail.com",
    "Carbs": 340,
    "Fat": 82,
    "height": 171,
    "Targetweight": 74,
    "gender": "male",
    "name": "client1",
    "vegetarian": false,
    "Protein": 92,
    "activity": "lightly active",
    "age": 20,
    "password": "mitul9703",
    "weight": 61,
    "Calories": 2474,
    "added_meals": {
        "Friday": [
            {
                "fat": 29,
                "servings": 4,
                "calories": 877,
                "vegetarian": false,
                "title": "Chicken Tikka Masala Indian",
                "carbohydrates": 86,
                "price_per_serving": 513.47,
                "instructions": [
                    "Step 1: Cut chicken breasts into large chunks approx. 2-inches thick and combine with marinade/pre-rub of 1/2 tsp coriander, 1/2 tsp cumin, and 1/2 salt. This is an optional step and does add to the total cooking time, but doing it will make the chicken itself taste better. Set aside for 20 minutes at room temperature or place in the refrigerator for 1 or 2 hours. (Spice measurements were not included above to avoid confusion.)",
                    "Step 2: In large, heavy pot or Dutch oven on medium heat saute the onions and minced garlic in oil until well browned.",
                    "Step 3: Add the remaining ingredients (minus the chicken) and stir continuously for about 5~10 minutes.",
                    "Step 4: Add chicken and cook over medium heat for 25~30 minutes stirring occasionally until chicken is cooked through. Near the last 5 minutes, add the yogurt and run to a boil while stirring. If the curry is too thick, some extra may be added according to personal preference.",
                    "Step 5: Remove from heat and set to cool a few minutes.",
                    "Step 6: Plate with warm, sticky rice (basmati and non-sticky rice work well too) and top with curry.",
                    "Step 7: Garnish with available cilantro leaves and enjoy."
                ],
                "ready_in_minutes": 45,
                "ingredients": [
                    "chicken breast",
                    "coriander",
                    "marinade",
                    "whole chicken",
                    "cumin",
                    "salt",
                    "dry seasoning rub",
                    "minced garlic",
                    "onion",
                    "cooking oil",
                    "yogurt",
                    "sticky rice",
                    "fresh cilantro"
                ],
                "health_score": 40,
                "gluten_free": false,
                "summary": "The recipe Chicken Tikka Masalan Indian could satisfy your Indian craving in roughly <b>45 minutes</b>. This main course has <b>877 calories</b>, <b>65g of protein</b>, and <b>29g of fat</b> per serving. This recipe serves 4 and costs $5.13 per serving. A mixture of chicken breasts, paprika, yogurt, and a handful of other ingredients are all it takes to make this recipe so scrumptious. This recipe from Foodista has 1 fans. All things considered, we decided this recipe <b>deserves a spoonacular score of 74%</b>. This score is pretty good. Similar recipes are <a href=\"https://spoonacular.com/recipes/chicken-tikka-masala-how-to-make-chicken-tikka-masala-1200017\">chicken tikka masala , how to make chicken tikka masala</a>, <a href=\"https://spoonacular.com/recipes/chicken-tikka-masala-how-to-make-chicken-tikka-masala-665989\">chicken tikka masala , how to make chicken tikka masala</a>, and <a href=\"https://spoonacular.com/recipes/chicken-tikka-masala-how-to-make-chicken-tikka-masala-1222765\">chicken tikka masala , how to make chicken tikka masala</a>.",
                "source_url": "https://www.foodista.com/recipe/P7ZX4DTZ/chicken-tikka-masala-indian",
                "image_url": "https://spoonacular.com/recipeImages/638389-312x231.jpg",
                "missing_ingredients": [],
                "protein": 64
            },
            {
                "gluten_free": true,
                "health_score": 45,
                "servings": 4,
                "image_url": "https://spoonacular.com/recipeImages/638642-312x231.jpg",
                "missing_ingredients": [],
                "fat": 45,
                "carbohydrates": 48,
                "calories": 779,
                "title": "Chinese Chicken Salad With Chipotle Dressing",
                "summary": "The recipe Chinese Chicken Salad With Chipotle Dressing is ready <b>in roughly 45 minutes</b> and is definitely a tremendous <b>gluten free and dairy free</b> option for lovers of Chinese food. For <b>$3.9 per serving</b>, this recipe <b>covers 39%</b> of your daily requirements of vitamins and minerals. This main course has <b>780 calories</b>, <b>51g of protein</b>, and <b>46g of fat</b> per serving. This recipe serves 4. 7 people were impressed by this recipe. Head to the store and pick up romaine lettuce, carrots, mint leaves, and a few other things to make it today. It is brought to you by Foodista. All things considered, we decided this recipe <b>deserves a spoonacular score of 86%</b>. This score is spectacular. If you like this recipe, you might also like recipes such as <a href=\"https://spoonacular.com/recipes/chinese-chicken-salad-with-sesame-dressing-1226459\">Chinese Chicken Salad with Sesame Dressing</a>, <a href=\"https://spoonacular.com/recipes/chinese-chicken-salad-with-sesame-dressing-510753\">Chinese Chicken Salad with Sesame Dressing</a>, and <a href=\"https://spoonacular.com/recipes/doms-chinese-chicken-salad-dressing-143924\">Dom's Chinese Chicken Salad Dressing</a>.",
                "ready_in_minutes": 45,
                "source_url": "https://www.foodista.com/recipe/JHBGMT48/bobby-flays-chinese-chicken-salad-with-chile-pea-mond-dressing",
                "price_per_serving": 390.43,
                "vegetarian": false,
                "ingredients": [
                    "chipotle chiles",
                    "salt and pepper",
                    "canola oil",
                    "sesame oil",
                    "soy sauce",
                    "vinegar",
                    "almonds",
                    "ginger",
                    "peanuts",
                    "honey",
                    "green onions",
                    "snow peas",
                    "cilantro",
                    "cabbage",
                    "carrot",
                    "lettuce",
                    "shredded chicken",
                    "mint",
                    "chili oil",
                    "lime"
                ],
                "protein": 51,
                "instructions": [
                    "Step 1: Whisk together the vinegar, peanut & almond butters, ginger, chipotle pepper puree, soy sauce, honey, sesame oil, and canola oil in a medium bowl. Season with salt and pepper, to taste.",
                    "Step 1: Combine cabbage, lettuce, carrots, snow peas, cilantro, and green onion in a large bowl.",
                    "Step 2: Add the dressing and toss to combine.",
                    "Step 3: Transfer to a serving platter and top with the shredded chicken, chopped peanuts, and mint.",
                    "Step 4: Drizzle with chili oil, if desired.",
                    "Step 5: Garnish with lime halves."
                ]
            },
            {
                "carbohydrates": 7,
                "title": "Kashmiri Rogan Josh",
                "vegetarian": false,
                "ingredients": [
                    "fennel seeds",
                    "yogurt",
                    "asafoetida",
                    "cinnamon",
                    "ground cayenne pepper",
                    "paprika",
                    "clove",
                    "meat",
                    "salt",
                    "cooking oil",
                    "fennel",
                    "ginger",
                    "broth",
                    "water",
                    "garam masala",
                    "brown sauce"
                ],
                "missing_ingredients": [],
                "fat": 62,
                "ready_in_minutes": 45,
                "protein": 44,
                "calories": 778,
                "gluten_free": true,
                "image_url": "https://spoonacular.com/recipeImages/648774-312x231.jpg",
                "source_url": "http://www.foodista.com/recipe/SQPFZHZF/kashmiri-rogan-josh",
                "health_score": 20,
                "summary": "You can never have too many main course recipes, so give Kashmiri Rogan Josh a try. This recipe serves 6 and costs $4.17 per serving. One portion of this dish contains about <b>44g of protein</b>, <b>63g of fat</b>, and a total of <b>778 calories</b>. Not a lot of people made this recipe, and 1 would say it hit the spot. This recipe from Foodista requires pch asafetida, yogurt, cayenne pepper, and ginger. It is a <b>pretty expensive</b> recipe for fans of Indian food. It is a good option if you're following a <b>gluten free and ketogenic</b> diet. From preparation to the plate, this recipe takes about <b>45 minutes</b>. Taking all factors into account, this recipe <b>earns a spoonacular score of 71%</b>, which is solid. If you like this recipe, take a look at these similar recipes: <a href=\"https://spoonacular.com/recipes/kashmiri-rogan-josh-1199343\">Kashmiri Rogan Josh</a>, <a href=\"https://spoonacular.com/recipes/rogan-josh-kashmiri-lamb-curry-97325\">Rogan Josh (Kashmiri Lamb Curry)</a>, and <a href=\"https://spoonacular.com/recipes/kashmiri-rogan-josh-indian-mutton-lamb-curry-98123\">Kashmiri Rogan Josh (Indian Mutton/ Lamb Curry)</a>.",
                "instructions": [
                    "Step 1: Grind the fennel seeds until find.",
                    "Step 2: Put the yogurt in a bowl and beat it with a fork until smooth and creamy.",
                    "Step 3: Heat the oil in a large pot over a high flame. When hot, put in the cinnamon and cloves.A second later, put in the ground asafetida. A second after that, put in all the meat and the salt.Stir the meat an cook, still on a high flame for about 5 minutes. Now put in the paprika and cayenne and give the meat a good stir. Slowly add the yogurt, a small amount at a time, stirring the meat vigorously as you do so.",
                    "Step 4: Add all the yogurt this way. Keep cooking on high heat until all liquid has boiled away and the meat pieces have browned slightly.",
                    "Step 5: Add the fennel and ginger. Give the meat some more good stirs. Now put in the water or broth, cover so as to leave the lid very slightly ajar, and cook on medium heat for 30 minutes.Cover completely and cook on low heat for another 45 minutes or until meat is tinder. Stir a few times as the meat cooks, making sure that there is always some liquid in the pot.",
                    "Step 6: Remove the lid and add the garam masala. You should have a thick, reddish brown sauce. If it is too thin, boil away some of the liquid."
                ],
                "price_per_serving": 416.84,
                "servings": 6
            },
            {
                "summary": "The recipe Chicken and Miso Ramen Noodle Soup is ready <b>in about 30 minutes</b> and is definitely an excellent <b>dairy free</b> option for lovers of Japanese food. This recipe makes 2 servings with <b>727 calories</b>, <b>46g of protein</b>, and <b>18g of fat</b> each. For <b>$3.27 per serving</b>, this recipe <b>covers 37%</b> of your daily requirements of vitamins and minerals. It works well as a rather expensive main course for <b>Autumn</b>. 1 person has made this recipe and would make it again. This recipe from Foodista requires sesame seeds, chicken breast, hardboiled eggs, and spring onion. All things considered, we decided this recipe <b>deserves a spoonacular score of 74%</b>. This score is pretty good. Users who liked this recipe also liked <a href=\"https://spoonacular.com/recipes/ramen-chicken-noodle-soup-822463\">Ramen Chicken Noodle Soup</a>, <a href=\"https://spoonacular.com/recipes/ramen-chicken-noodle-soup-1274333\">Ramen Chicken Noodle Soup</a>, and <a href=\"https://spoonacular.com/recipes/cooking-school-miso-ramen-with-miso-glazed-chicken-enoki-and-shimeji-mushrooms-629499\">Cooking School: Miso Ramen with Miso Glazed Chicken, Enoki and Shimeji Mushrooms</a>.",
                "ready_in_minutes": 30,
                "vegetarian": false,
                "price_per_serving": 326.57,
                "carbohydrates": 93,
                "calories": 727,
                "image_url": "https://spoonacular.com/recipeImages/637908-312x231.jpg",
                "missing_ingredients": [],
                "source_url": "http://www.foodista.com/recipe/LSGT2GRK/chicken-and-miso-ramen-noodle-soup",
                "protein": 46,
                "title": "Chicken and Miso Ramen Noodle Soup",
                "servings": 2,
                "health_score": 36,
                "gluten_free": false,
                "ingredients": [
                    "chicken stock",
                    "ginger",
                    "miso",
                    "angel hair pasta",
                    "vegetable",
                    "whole chicken",
                    "pasta",
                    "nori",
                    "soup",
                    "sesame seeds",
                    "tamari",
                    "sauce"
                ],
                "instructions": [
                    "Step 1: Pour the chicken stock into a suitable pot.",
                    "Step 2: Add the miso and sliced ginger and stir to mix while bringing to a simmer.Simmer for 10 minutes, stirring occasionally.",
                    "Step 3: Place the fresh angel hair pasta noodles in the bottom of the bowls uncooked; then while the soup is still hot, pour it over the noodles to a depth that just covers them.Arrange the chicken and vegetables carefully on top of the noodles or beside the noodles so that everything is level with the top of the soup and the arrangement is attractive.Carefully slide the nori into the edge of the soup only partially submerging it.",
                    "Step 4: Sprinkle the sesame seeds on top if desired and serve with soy or tamari sauce."
                ],
                "fat": 17
            }
        ],
        "Monday": [
            {
                "servings": 1,
                "calories": 864,
                "protein": 34,
                "ready_in_minutes": 45,
                "vegetarian": true,
                "price_per_serving": 260.19,
                "health_score": 89,
                "fat": 34,
                "carbohydrates": 112,
                "ingredients": [
                    "sesame seeds",
                    "olive oil",
                    "hummus",
                    "tahini",
                    "sandwich bread",
                    "water",
                    "cucumber",
                    "tortilla",
                    "carrot",
                    "lettuce",
                    "olives",
                    "spread",
                    "wrap"
                ],
                "image_url": "https://spoonacular.com/recipeImages/647638-312x231.jpg",
                "summary": "If you have about <b>45 minutes</b> to spend in the kitchen, Hummus Wrap With Carrots and Cucumbers might be a super <b>gluten free, dairy free, lacto ovo vegetarian, and vegan</b> recipe to try. This recipe serves 1 and costs $2.6 per serving. One portion of this dish contains around <b>35g of protein</b>, <b>34g of fat</b>, and a total of <b>864 calories</b>. Not a lot of people really liked this hor d'oeuvre. 1 person were impressed by this recipe. This recipe from Foodista requires salt, garbanzo beans, hummus, and cucumber. This recipe is typical of middl eastern cuisine. Overall, this recipe earns an <b>outstanding spoonacular score of 92%</b>. Similar recipes are <a href=\"https://spoonacular.com/recipes/hummus-wrap-with-carrots-and-cucumbers-1635825\">Hummus Wrap With Carrots and Cucumbers</a>, <a href=\"https://spoonacular.com/recipes/hummus-wrap-with-carrots-and-cucumbers-1605265\">Hummus Wrap With Carrots and Cucumbers</a>, and <a href=\"https://spoonacular.com/recipes/banh-mi-wrap-vietnamese-grilled-pork-wrap-with-pickled-carrots-and-mint-1353135\">Banh-mi Wrap: Vietnamese Grilled Pork Wrap with Pickled Carrots and Mint</a>.",
                "instructions": [
                    "Step 1: Start with hummus. Throw all the ingredients into a food processor and process until smooth. The mixture might be a bit thick and hard to process so you can add few tablespoons of water or a bit more olive oil.Tip: if I dont have tahini at home I simply toast 1 or 2 Tbsp sesame seeds and throw to a food processor instead of tahini.",
                    "Step 2: Spread 2 Tbsp hummus in the center of a tortilla leaving about an inch on a top and bottom and few inches on a sides.Follow with the lettuce, carrots, cucumbers and olives.Fold top and bottom edges of the tortilla, turn 90 degrees and wrap the remaining tortilla around the filling. Wrap the tortilla in aluminum foil to hold its shape.",
                    "Step 3: Cut into half."
                ],
                "title": "Hummus Wrap With Carrots and Cucumbers",
                "source_url": "http://www.foodista.com/recipe/68PJV275/hummus-wrap-with-carrots-and-cucumbers",
                "gluten_free": true,
                "missing_ingredients": []
            },
            {
                "carbohydrates": 72,
                "image_url": "https://spoonacular.com/recipeImages/632026-312x231.jpg",
                "summary": "The recipe Ahi Tuna with Sweet and Spicy Asian Slaw can be made <b>in around 45 minutes</b>. One portion of this dish contains around <b>27g of protein</b>, <b>50g of fat</b>, and a total of <b>828 calories</b>. This dairy free and pescatarian recipe serves 2 and costs <b>$7.28 per serving</b>. This recipe from Foodista has 1 fans. This recipe is typical of Asian cuisine. A mixture of carrots, soy sauce, rice wine vinegar, and a handful of other ingredients are all it takes to make this recipe so tasty. It works well as a main course. It is perfect for <b>The Fourth Of July</b>. All things considered, we decided this recipe <b>deserves a spoonacular score of 70%</b>. This score is solid. If you like this recipe, take a look at these similar recipes: <a href=\"https://spoonacular.com/recipes/seared-ahi-tuna-taco-with-asian-slaw-and-plum-sauce-345073\">Seared Ahi Tuna Taco with Asian Slaw and Plum sauce</a>, <a href=\"https://spoonacular.com/recipes/spicy-sweet-asian-slaw-with-pickled-daikon-199567\">Spicy-Sweet Asian Slaw with Pickled Daikon</a>, and <a href=\"https://spoonacular.com/recipes/sweet-and-spicy-barbecue-pork-with-asian-slaw-529873\">Sweet and Spicy Barbecue Pork with Asian Slaw</a>.",
                "price_per_serving": 728.02,
                "vegetarian": false,
                "instructions": [
                    "Step 1: In a large mixing bowl combine extra virgin olive oil, soy sauce, sesame oil, rice wine vinegar, honey, mayonnaise, lime zest, minced garlic, minced ginger, salt, and brown sugar; set aside.",
                    "Step 2: Thinly slice napa cabbage and green cabbage, place into another large mixing bowl. Julienne carrots and add to cabbage, set aside.",
                    "Step 3: Combine cabbage with dressing and toss in black sesame seeds, wasabi peas and Tropical Foods Mexicali Fire.",
                    "Step 4: Crust each tuna filet with course ground black pepper. Grill or saut for 2 minutes on each side until seared, but still raw inside.",
                    "Step 5: Slice and plate with Asian slaw."
                ],
                "title": "Ahi Tuna with Sweet and Spicy Asian Slaw",
                "health_score": 35,
                "ready_in_minutes": 45,
                "protein": 26,
                "gluten_free": false,
                "missing_ingredients": [],
                "ingredients": [
                    "extra virgin olive oil",
                    "rice vinegar",
                    "minced garlic",
                    "brown sugar",
                    "mayonnaise",
                    "sesame oil",
                    "lime zest",
                    "soy sauce",
                    "ginger",
                    "honey",
                    "salt",
                    "green cabbage",
                    "napa cabbage",
                    "cabbage",
                    "carrot",
                    "black sesame seeds",
                    "wasabi peas",
                    "ground black pepper",
                    "crust",
                    "tuna"
                ],
                "servings": 2,
                "fat": 49,
                "calories": 828,
                "source_url": "https://www.foodista.com/recipe/KLHJ27JF/ahi-tuna-with-sweet-and-spicy-asian-slaw"
            },
            {
                "summary": "Crock-Pot: Asian-Style Country Ribs with Black Bean Garlic Sauce could be just the <b>dairy free and ketogenic</b> recipe you've been looking for. One serving contains <b>732 calories</b>, <b>39g of protein</b>, and <b>58g of fat</b>. This recipe serves 4. For <b>$2.35 per serving</b>, this recipe <b>covers 25%</b> of your daily requirements of vitamins and minerals. Many people really liked this main course. If you have soy salt, country, ginger root, and a few other ingredients on hand, you can make it. 912 people have made this recipe and would make it again. It is a <b>rather inexpensive</b> recipe for fans of Asian food. It is brought to you by oneperfectbite.blogspot.com. From preparation to the plate, this recipe takes roughly <b>45 minutes</b>. Overall, this recipe earns a <b>good spoonacular score of 75%</b>. Users who liked this recipe also liked <a href=\"https://spoonacular.com/recipes/crock-pot-asian-style-country-ribs-with-black-bean-garlic-sauce-1242665\">Crock-Pot: Asian-Style Country Ribs with Black Bean Garlic Sauce</a>, <a href=\"https://spoonacular.com/recipes/crock-pot-indonesian-style-country-ribs-114372\">Crock Pot Indonesian Style Country Ribs</a>, and <a href=\"https://spoonacular.com/recipes/crock-pot-bbq-country-style-ribs-484544\">Crock Pot BBQ Country Style Ribs</a>.",
                "servings": 4,
                "fat": 58,
                "source_url": "http://oneperfectbite.blogspot.com/2008/10/crock-pot-asian-style-country-ribs-with.html",
                "missing_ingredients": [],
                "health_score": 12,
                "title": "Crock-Pot: Asian-Style Country Ribs with Black Bean Garlic Sauce",
                "instructions": [
                    "Step 1: This crock-pot entre is really, really good. It takes 10 minutes to prepare, is made from ingredients that are readily available and is a bargain when you consider the number of servings it provides.  One caution -  you'll have mush with  Asian flavor if you cook this for more than 5 to 6 hours. The recipe is adapted from \"Slow Cooker Recipes for All Occasions\",  a Rival Crock-Pot publication.",
                    "Step 2: Served with rice and snow peas you have the makings of a minor feast that you'll repeat often. My family loves this dish. I think yours will, too. This, by the way, is a wonderful recipe for novice cooks. If you have a willing teen, let them have a go at it.Asian-Style Country Ribs with Black Bean Garlic Sauce",
                    "Step 1: Spray interior of slow cooker with nonstick cooking spray.",
                    "Step 2: Place pork cubes in slow cooker.",
                    "Step 3: Combine black bean garlic sauce, soy sauce, mirin, honey, ginger, garlic, pepper and cornstarch in a small bowl; stir to dissolve cornstarch.",
                    "Step 4: Pour over ribs.",
                    "Step 5: Cook, covered, on LOW setting for 5 to 6 hours until ribs are tender but still hold their shape.",
                    "Step 6: Transfer ribs to a rimmed serving platter; tent with foil to keep warm. Strain liquid into a small pan. Bring liquid to a boil over medium-high heat; cook until mixture begins to thicken and is reduced by half. Stir in sesame oil.",
                    "Step 7: Add sauce and 1/4 cup scallions to pork cubes.",
                    "Step 8: Mix well.",
                    "Step 9: Garnish with reserved 2 tablespoons scallions."
                ],
                "carbohydrates": 11,
                "image_url": "https://spoonacular.com/recipeImages/735820-312x231.jpg",
                "ready_in_minutes": 45,
                "protein": 38,
                "gluten_free": false,
                "price_per_serving": 234.99,
                "vegetarian": false,
                "ingredients": [
                    "snow peas",
                    "garlic",
                    "sauce",
                    "ribs",
                    "rice",
                    "cooking spray",
                    "pork",
                    "corn starch",
                    "soy sauce",
                    "ginger",
                    "pepper",
                    "honey",
                    "mirin",
                    "sesame oil",
                    "green onions"
                ],
                "calories": 732
            },
            {
                "gluten_free": true,
                "summary": "Need a <b>gluten free, dairy free, whole 30, and ketogenic main course</b>? Curry Chicken Salad could be an amazing recipe to try. This recipe serves 2 and costs $3.23 per serving. One serving contains <b>683 calories</b>, <b>35g of protein</b>, and <b>53g of fat</b>. Head to the store and pick up salad greens, carrot, turmeric powder, and a few other things to make it today. From preparation to the plate, this recipe takes roughly <b>25 minutes</b>. It is a <b>pretty expensive</b> recipe for fans of Indian food. This recipe is liked by 1 foodies and cooks. It is brought to you by Foodista. Overall, this recipe earns a <b>good spoonacular score of 60%</b>. Users who liked this recipe also liked <a href=\"https://spoonacular.com/recipes/curry-chicken-salad-123174\">Curry Chicken Salad</a>, <a href=\"https://spoonacular.com/recipes/curry-chicken-salad-471066\">Curry Chicken Salad</a>, and <a href=\"https://spoonacular.com/recipes/curry-chicken-salad-1244899\">Curry Chicken Salad</a>.",
                "calories": 682,
                "ingredients": [
                    "whole chicken",
                    "water",
                    "salt and pepper",
                    "turmeric",
                    "curry powder",
                    "mayonnaise",
                    "seasoning",
                    "cucumber",
                    "carrot",
                    "celery",
                    "grapes",
                    "spices",
                    "soft drink",
                    "greens"
                ],
                "health_score": 18,
                "price_per_serving": 322.54,
                "fat": 52,
                "servings": 2,
                "title": "Curry Chicken Salad",
                "missing_ingredients": [],
                "instructions": [
                    "Step 1: Strain the water from the cans of chicken and place the chicken in large mixing bowl.",
                    "Step 2: Add mayonnaise. You can use more or less based on how moist you like your chicken salad.Season with salt and pepper to taste, go easy on the seasoning at this point because the main seasoning will occur at the end when you add the spices. Drop in the diced celery, carrot, cucumber and grapes and mix well. Once all the ingredients have been combined, add additional mayonnaise if you prefer a wetter consistency to the salad.Once the consistency is right, add in curry powder and turmeric powder. These are they key ingredients, so make sure you are using high quality spices. Start with a small amount of each spice and gradually add to taste - the measurements here are just recommendations, you should taste test as you go along. If possible, pop your mixing bowl into the fridge for an hour to let the flavors marry.",
                    "Step 3: Serve of the Curry Chicken Salad on top of salad greens, no dressing necessary."
                ],
                "image_url": "https://spoonacular.com/recipeImages/650378-312x231.jpg",
                "ready_in_minutes": 25,
                "carbohydrates": 16,
                "source_url": "http://www.foodista.com/recipe/RSNP5GR2/low-carb-curry-chicken-salad",
                "protein": 34,
                "vegetarian": false
            }
        ],
        "Wednesday": [
            {
                "calories": 545,
                "vegetarian": false,
                "missing_ingredients": [],
                "protein": 32,
                "summary": "The recipe Asian Chicken and Broccoli With Chili Garlic Sauce could satisfy your Asian craving in approximately <b>45 minutes</b>. One serving contains <b>546 calories</b>, <b>33g of protein</b>, and <b>9g of fat</b>. For <b>$2.42 per serving</b>, this recipe <b>covers 35%</b> of your daily requirements of vitamins and minerals. This recipe serves 4. 3 people have tried and liked this recipe. <b>The Super Bowl</b> will be even more special with this recipe. It works well as a rather inexpensive main course. It is a good option if you're following a <b>gluten free and dairy free</b> diet. If you have cornstarch, fish sauce, chili garlic sauce, and a few other ingredients on hand, you can make it. It is brought to you by Foodista. Overall, this recipe earns a <b>super spoonacular score of 93%</b>. Similar recipes are <a href=\"https://spoonacular.com/recipes/asian-chicken-and-broccoli-with-chili-garlic-sauce-530075\">Asian Chicken and Broccoli with Chili Garlic Sauce</a>, <a href=\"https://spoonacular.com/recipes/video-crunchy-asian-fried-chicken-with-garlic-chili-sauce-527792\">{Video} Crunchy Asian Fried Chicken with Garlic Chili Sauce</a>, and <a href=\"https://spoonacular.com/recipes/asian-broccoli-salad-with-tangy-chili-garlic-dressing-733071\">Asian Broccoli Salad with Tangy Chili-Garlic Dressing</a>.",
                "ingredients": [
                    "chili garlic sauce",
                    "rice vinegar",
                    "corn starch",
                    "fish sauce",
                    "soy sauce",
                    "mirin",
                    "water",
                    "cooking spray",
                    "sesame oil",
                    "broccoli",
                    "chicken broth",
                    "cooked chicken",
                    "whole chicken",
                    "sauce",
                    "basmati rice"
                ],
                "gluten_free": true,
                "ready_in_minutes": 45,
                "title": "Asian Chicken and Broccoli With Chili Garlic Sauce",
                "price_per_serving": 241.97,
                "health_score": 100,
                "fat": 9,
                "instructions": [
                    "Step 1: Combine rice vinegar, Mirin, water, chili garlic sauce, fish sauce, soy sauce and cornstarch in a bowl.",
                    "Step 2: Preheat a large skillet over medium-high heat and spray with cooking spray.",
                    "Step 3: Add sesame oil and stir fry broccoli for 3  4 minutes until crisp-tender.",
                    "Step 4: Add 1/4 cup chicken broth if needed to keep from burning.",
                    "Step 5: Add cooked chicken and sauce. Cook another 3  4 minutes until sauce thickens and chicken is heated through.",
                    "Step 6: Serve with basmati rice."
                ],
                "source_url": "https://www.foodista.com/recipe/SKWZFWYW/asian-chicken-and-broccoli-with-chili-garlic-sauce",
                "carbohydrates": 83,
                "image_url": "https://spoonacular.com/recipeImages/632812-312x231.jpg",
                "servings": 4
            },
            {
                "missing_ingredients": [],
                "protein": 19,
                "health_score": 63,
                "instructions": [
                    "Step 1: Cook pasta according to package instructions. During the last minute, add in the broccoli.In the meantime, you can cook the vegetables and prepare the dressing.",
                    "Step 2: Heat olive oil in small non-stick skillet, saut onions until slightly soften.",
                    "Step 3: Add in garlic and continue to saut until fragrant. add in sweet peppers and cook until slightly softened.",
                    "Step 4: Remove from heat, add in remaining ingredients to finish making the sauce.",
                    "Step 5: Add salt and pepper to taste.When the pasta and broccoli is ready, add them to the skillet and stir well. Stir in cilantro leaves.",
                    "Step 6: Served at room temperature or chilled."
                ],
                "ready_in_minutes": 45,
                "carbohydrates": 91,
                "title": "Thai Pasta Salad",
                "fat": 16,
                "servings": 2,
                "vegetarian": false,
                "price_per_serving": 202.46,
                "image_url": "https://spoonacular.com/recipeImages/663126-312x231.jpg",
                "calories": 557,
                "summary": "Thai Pasta Salad might be just the <b>Asian</b> recipe you are searching for. This recipe serves 2 and costs $2.02 per serving. This main course has <b>558 calories</b>, <b>20g of protein</b>, and <b>16g of fat</b> per serving. From preparation to the plate, this recipe takes around <b>45 minutes</b>. If you have peppers, lemon juice, soy sauce, and a few other ingredients on hand, you can make it. 1 person has tried and liked this recipe. It is brought to you by Foodista. It is a good option if you're following a <b>dairy free and pescatarian</b> diet. With a spoonacular <b>score of 87%</b>, this dish is tremendous. Try <a href=\"https://spoonacular.com/recipes/thai-peanut-pasta-salad-1434813\">Thai Peanut Pasta Salad</a>, <a href=\"https://spoonacular.com/recipes/thai-chicken-pasta-salad-425178\">Thai Chicken Pasta Salad</a>, and <a href=\"https://spoonacular.com/recipes/thai-pasta-side-salad-395046\">Thai Pasta Side Salad</a> for similar recipes.",
                "source_url": "http://www.foodista.com/recipe/JTBZ3CHD/thai-pasta-salad",
                "ingredients": [
                    "vegetable",
                    "broccoli",
                    "pasta",
                    "olive oil",
                    "onion",
                    "peppers",
                    "garlic",
                    "sauce",
                    "fresh cilantro",
                    "salt and pepper"
                ],
                "gluten_free": false
            },
            {
                "missing_ingredients": [],
                "servings": 4,
                "health_score": 42,
                "protein": 18,
                "price_per_serving": 363.42,
                "title": "Asian Noodles",
                "instructions": [
                    "Step 1: Cook noodles according to package directions; drain well.Blanch snow peas in boiling water 1 minute.",
                    "Step 2: Drain and refresh in cold water, then pat dry.",
                    "Step 3: Transfer to medium bowl.",
                    "Step 4: Add carrots and scallions.In medium skillet, heat oil over medium heat.",
                    "Step 5: Add garlic and chile pepper and cook, stirring often, 30 seconds.",
                    "Step 6: Add mushrooms and cook, stirring often, 2 minutes.",
                    "Step 7: Add mushrooms to bowl with vegetables.",
                    "Step 8: Add vinegar, ginger and hoisin sauce to pan and warm through.",
                    "Step 9: Pour over vegetables.",
                    "Step 10: Add noodles and toss.",
                    "Step 11: Serve warm or at room temperature.This recipe yields 4 servings.Comments: Once the vegetables have been sliced, this tasty main dish salad can be thrown together in minutes.",
                    "Step 12: Serve these noodles with a packaged miso soup mix."
                ],
                "source_url": "http://www.foodista.com/recipe/Z3NDBPTS/asian-noodles",
                "vegetarian": false,
                "calories": 549,
                "gluten_free": false,
                "summary": "Asian Noodles is a <b>dairy free</b> recipe with 4 servings. One serving contains <b>549 calories</b>, <b>18g of protein</b>, and <b>18g of fat</b>. For <b>$3.63 per serving</b>, this recipe <b>covers 32%</b> of your daily requirements of vitamins and minerals. If you have snow peas, cashews, garlic clove, and a few other ingredients on hand, you can make it. Only a few people made this recipe, and 1 would say it hit the spot. It works well as a main course. From preparation to the plate, this recipe takes around <b>45 minutes</b>. It is brought to you by Foodista. This recipe is typical of Asian cuisine. All things considered, we decided this recipe <b>deserves a spoonacular score of 79%</b>. This score is good. If you like this recipe, take a look at these similar recipes: <a href=\"https://spoonacular.com/recipes/five-shreds-longevity-noodles-for-the-new-year-from-easy-asian-noodles-208360\">Five Shreds Longevity Noodles for the New Year from 'Easy Asian Noodles</a>, <a href=\"https://spoonacular.com/recipes/asian-noodles-334557\">Asian Noodles</a>, and <a href=\"https://spoonacular.com/recipes/asian-peanut-noodles-161777\">Asian Peanut Noodles</a>.",
                "ready_in_minutes": 45,
                "image_url": "https://spoonacular.com/recipeImages/632854-312x231.jpg",
                "ingredients": [
                    "snow peas",
                    "pasta",
                    "water",
                    "green onions",
                    "carrot",
                    "cooking oil",
                    "chili pepper",
                    "garlic",
                    "mushrooms",
                    "vegetable",
                    "hoisin sauce",
                    "vinegar",
                    "ginger",
                    "miso soup"
                ],
                "carbohydrates": 79,
                "fat": 18
            },
            {
                "health_score": 32,
                "summary": "If you want to add more <b>dairy free and pescatarian</b> recipes to your recipe box, Vietnamese Noodle Salad With Tofu might be a recipe you should try. One serving contains <b>816 calories</b>, <b>27g of protein</b>, and <b>40g of fat</b>. For <b>$3.91 per serving</b>, you get a main course that serves 2. This recipe from Foodista requires juice of lime, cane sugar, chili, and spring onion. This recipe is typical of Vietnamese cuisine. 1 person has tried and liked this recipe. From preparation to the plate, this recipe takes roughly <b>45 minutes</b>. All things considered, we decided this recipe <b>deserves a spoonacular score of 82%</b>. This score is excellent. Try <a href=\"https://spoonacular.com/recipes/vietnamese-tofu-noodle-lettuce-wraps-37288\">Vietnamese Tofu-noodle Lettuce Wraps</a>, <a href=\"https://spoonacular.com/recipes/vietnamese-beef-noodle-soup-with-asian-greens-okay-vietnamese-japanese-664830\">Vietnamese Beef-Noodle Soup With Asian Greens, Okay Vietnamese/japanese</a>, and <a href=\"https://spoonacular.com/recipes/vietnamese-beef-noodle-soup-with-asian-greens-okay-vietnamese-japanese-1469207\">Vietnamese Beef-Noodle Soup With Asian Greens, Okay Vietnamese/japanese</a> for similar recipes.",
                "price_per_serving": 390.93,
                "protein": 26,
                "missing_ingredients": [],
                "vegetarian": false,
                "servings": 2,
                "title": "Vietnamese Noodle Salad With Tofu",
                "fat": 39,
                "ready_in_minutes": 45,
                "source_url": "http://www.foodista.com/recipe/NXYGJ2H6/vietnamese-noodle-salad-with-tofu",
                "carbohydrates": 92,
                "image_url": "https://spoonacular.com/recipeImages/664835-312x231.jpg",
                "ingredients": [
                    "sesame oil",
                    "marinade",
                    "garlic",
                    "ginger",
                    "chili pepper",
                    "tofu",
                    "broccoli florets",
                    "spring onions",
                    "red pepper",
                    "vegetable",
                    "cucumber",
                    "pasta",
                    "peanuts",
                    "carrot",
                    "herbs",
                    "water"
                ],
                "calories": 816,
                "gluten_free": false,
                "instructions": [
                    "Step 1: The tofu: Slice up the tofu (3/4 cm thick slices) and marinade it over night (or at least for 2 hours) in soya, sesame oil, and sliced garlic gloves.The marinade: Finely chop chili, ginger, and garlic.",
                    "Step 1: Heat up a large pan and fry the marinated tofu at medium heat untill golden brown. In a dish, pour boiled water over the broccoli florets and leave for 5 minutes before draining off excess water. Prepare the noodles according to the manufacturer. Finely chop the spring onion and remove the inner watery part of the cucumber. Slice up the carrot, cucumber, red pepper, and iceberg into fine screds and roughly chop both herbs and peanuts.Arrange in two large bowls. First iceberg, then noodles, vegetables, tofu, herbs, peanuts and marinade."
                ]
            }
        ]
    }
}